{"Stage 2 Capital Deck_2025.01.pdf": {"Page Number: 1": "This page appears to be from a corporate presentation for Stage 2 Capital. It has a dark background with a geometric pattern of interconnected cubes on the left side in a teal/turquoise color. The main content features three lines of text in white and orange:\n\nThe headline reads \"Scaling with Science. Backed by GTM Expertise.\" in large white text.\n\nBelow that is explanatory text stating \"We equip B2B founders with proven playbooks, expert GTM and finance guidance, and an LP network of 800+ executives who've done it before.\"\n\nThe words \"proven playbooks,\" \"GTM and finance guidance,\" and \"800+ executives\" are highlighted in orange.\n\nIn the bottom right corner is the \"STAGE 2 CAPITAL\" logo in white text against the dark background.\n\nAt the top right of the page, there is text marking the document as \"CONFIDENTIAL | Do Not Distribute\"", "Page Number: 2": "This page appears to be the disclaimer page from a Stage 2 Capital presentation. At the top of the page is the \"STAGE 2 CAPITAL\" logo in a simple black rectangular border. In the upper right corner, there is text marked \"CONFIDENTIAL | Do Not Distribute\". The page has a white background with black text and is labeled as page 2. The main content consists of several paragraphs of legal disclaimer text under a large \"Disclaimer\" heading. The text is formatted in clean, professional typography with consistent paragraph spacing. There are no graphs, charts, or other visual elements besides the logo and text.", "Page Number: 3": "This page presents a thesis statement with accompanying images that appear to be from business or networking events. The main text reads \"Our Thesis\" as a headline, followed by text explaining their investment focus on B2B software companies at Seed and Series A stages, emphasizing \"grow efficiently\" and \"sustainable revenue growth\" in orange text.\n\nThe page includes seven photographs arranged in a collage format on the right side:\n- A top photo showing an audience at what appears to be a conference or presentation\n- A middle photo showing people in business attire having a conversation\n- A conference room or auditorium scene with rows of seated attendees facing a stage with corporate branding\n- A photo of two people in business casual attire engaged in conversation\n- A photo of three people at what appears to be a networking event or conference\n- An image of someone presenting or speaking while standing\n- A photo of someone in profile speaking on a phone or device\n\nThe layout uses a teal/blue color for the main heading and orange highlights for key phrases in the thesis statement. The page appears to be page 3 of the presentation, as indicated by a small number at the bottom.", "Page Number: 4": "This page is titled \"Founder Story\" and appears to be from Stage 2 Capital's confidential materials, as indicated by a header marking. The page has a dark background with white and green text.\n\nThe left side contains three bullet points describing how the founders identified a GTM (go-to-market) gap in the startup ecosystem:\n- A point about findings after HubSpot went public\n- An observation from Bessemer about founders struggling with GTM strategy\n- The launch of Stage 2 Capital as Silicon Valley's first VC firm powered by GTM operators\n\nThe right side features two professional headshots arranged vertically with corresponding biographical information:\n\nTop: A professional wearing a black vest over a light blue shirt\nTitle: Jay Po\nRole: Managing Partner, Stage 2 Capital\nPrevious: Formerly Bessemer Venture Partners\n\nBottom: A professional wearing glasses and a grey shirt\nTitle: Mark Roberge\nRole: Managing Partner, Stage 2 Capital\nPrevious: Formerly Hubspot's Founding CRO\n\nThe page includes a slide number \"4\" in the bottom right corner and contains a \"CONFIDENTIAL | Do Not Distribute\" notice at the top.", "Page Number: 5": "This page appears to be from Stage 2 Capital's investment presentation. The page is titled \"Our Edge: A Unique Limited Partner Base\" in white text on a teal/green background. Below this is text stating \"800+ Senior Executive GTM LPs from top software companies globally.\"\n\nThe majority of the page displays a grid of technology company logos, featuring well-known software and technology companies including:\n\nTop rows:\n- Zoominfo, 6sense, Snowflake, Salesforce, HubSpot, Gong, Apollo.io, Clari\n- GitHub, Envoy, Notion, Brex, Asana, Zoom, Guild, Dropbox\n- Carta, Okta, Drata, Klaviyo, Smartsheet, Databricks, Webflow, Writer\n- Cloudflare, Grammarly, SailPoint, Calendly, Salesloft, Oracle, Miro, ServiceNow\n- Twilio, Atlassian, Palo Alto Networks, Toast, Datadog, Shopify, Freshworks, Seismic\n- Talkdesk, Gusto, Checkr, Plaid, Airtable, Automation Anywhere, Cribl, Contentful\n\nAt the bottom of the page, there is a small disclaimer in gray text noting that Stage 2 is not directly affiliated with the companies shown.\n\nThe page is marked as \"CONFIDENTIAL | Do Not Distribute\" in the top right corner.\n\nThe page number \"5\" appears in the bottom right corner.", "Page Number: 6": "This page appears to be from a Stage 2 Capital presentation, marked as \"CONFIDENTIAL | Do Not Distribute\" at the top of the page.\n\nThe page is titled \"World Class Limited Partners\" and displays a grid of professional headshots arranged in two rows of eight, showing various executives and board members from prominent technology companies. Each photo is accompanied by the person's title and company logo on a black background beneath their image.\n\nThe companies represented include:\n- HubSpot (multiple representatives)\n- Gainsight\n- Salesforce\n- Cribl\n- Highspot\n- Certina\n- Markforged\n- Box\n- PTC\n- Seismic\n- Yelp\n- Crowdstrike\n- Snowflake\n- OnBoard\n- Google Cloud\n\nThe photos are set against a light blue patterned background, and the page number \"6\" appears in the bottom right corner.\n\nThe layout is professional and clean, with consistent sizing and spacing between all elements. The images are high-quality professional headshots with each individual wearing business attire.", "Page Number: 7": "This page appears to be from a Stage 2 Capital presentation, marked as \"CONFIDENTIAL | Do Not Distribute\" at the top. The page shows a layout of GTM (Go-To-Market) Limited Partners organized into different categories:\n\nRevenue, Marketing, and Customer Success sections are shown on the left side as categories.\n\nThe page displays professional headshots arranged in two rows of six people each, with their associated companies and titles:\n\nTop Row (Revenue/Marketing):\n- From Shopify: Revenue Leader for Americas\n- From Confluent: President\n- From GitLab: CMO & CSO\n- From Brex: CMO\n- From an organization with a crescent moon logo: CMO\n- From Samsara: CMO\n\nBottom Row (Customer Success):\n- From Miro: CRO\n- From Snowflake: CRO\n- From Datadog: CRO\n- From Sumo Logic: CCO\n- From Teradata: CCO\n- From 6sense: CCO & CSO\n\nEach headshot is set against a light blue background, and company logos appear below each person's title. The page number \"7\" appears at the bottom right corner.", "Page Number: 8": "This page shows a fund progression chart from Stage 2 Capital titled \"Fund Progression: Introducing Fund IV\". The visualization displays four circles of increasing size arranged diagonally from left to right, representing the growth of their funds over time.\n\nThe progression shows:\n\nFund I (2018):\n- $15M total\n- 11 Investments\n- $500K-1M first checks\n- 2.5% ownership\n\nFund II (2020):\n- $80M total\n- 19 Investments\n- $2-3M first checks\n- 10% ownership\n\nFund III (2022):\n- $150M total\n- 18-20 Investments\n- $3-5M first checks\n- 15% ownership\n\nFund IV (2025) [Target]:\n- $150M total\n- 18-22 Investments\n- $3-5M first checks\n- 15% ownership\n\nThe visual uses a teal/turquoise color scheme with diagonal line patterns in the background. The target Fund IV is highlighted in a darker teal color. The page is marked as \"CONFIDENTIAL | Do Not Distribute\" in the top right corner and has a page number 8 at the bottom.", "Page Number: 9": "This page appears to be from a Stage 2 Capital presentation, marked as \"CONFIDENTIAL | Do Not Distribute\" at the top. The page is titled \"Institutional Backing\" and features two main visual elements:\n\n1. On the left side, there are several institutional logos arranged in a grid:\n- MIT IMCo (largest logo at top)\n- Rainwater Charitable Foundation\n- Grafton Street Partners\n- Athos Private Wealth\n- Brown Holdings\n- Sherman Fairchild Foundation\n\n2. On the right side, there is a photograph of what appears to be MIT's iconic Great Dome and classical columned architecture, with overlaid text reading \"Support from Top Institutions\" on a semi-transparent green overlay.\n\nThe page number 9 appears at the bottom right corner.", "Page Number: 10": "This page from Stage 2 Capital's presentation is titled \"Return Profiles\" and includes both graphical and textual elements.\n\nThe main heading states \"Return Profiles\" followed by explanatory text: \"Stage 2 aims for investments with predictable upside on exit vs. moonshot companies with high burn profiles.\"\n\nThe left side of the page shows two contrasting bar graphs separated by \"VS.\" The left graph (in orange) shows an irregular pattern of increasing bars. The right graph (in teal) shows mostly low bars with two significantly taller bars at the end.\n\nOn the right side of the page is an image showing a whiteboard with financial data and someone presenting in a business setting. Overlaid on this image is text reading \"Think Moneyball vs. Powerball\".\n\nAt the top left corner is the \"STAGE 2 CAPITAL\" logo, and at the top right corner is text marking the document as \"CONFIDENTIAL | Do Not Distribute\".\n\nThe page number \"10\" appears at the bottom right corner.", "Page Number: 11": "This page shows a \"Fund Snapshot\" from Stage 2 Capital and is marked as \"CONFIDENTIAL | Do Not Distribute\" at the top.\n\nThe page displays information about three funds (Fund I, Fund II, and Fund III) in a side-by-side comparison format:\n\nFund I:\n- $32M Average Investment Post Money Valuation\n- 2% Average Ownership\n- $15M Fund Size\n- 11 Investments\nNotable Investments shown with logos: Order, Ocrolus, Sendoso\nExits shown with logos: ListReports, Klara, OnScale\n\nFund II:\n- $28M Average Investment Post Money Valuation\n- 11.3% Average Ownership\n- $80M Fund Size\n- 19 Investments\nNotable Investments shown with logos: GigPro, DeepScribe, MyTime, QuotaPath\n\nFund III:\n- $33M Average Investment Post Money Valuation\n- 13.7% Average Ownership\n- $150M Fund Size\n- 19 Investments\nNotable Investments shown with logos: MedScout, Steelhead Technologies, Basis Theory, Versori, Intelligems, Momentum, Slang\n\nThe page is numbered \"11\" at the bottom right corner.", "Page Number: 12": "This page appears to be from a Stage 2 Capital investment presentation, marked as \"CONFIDENTIAL | Do Not Distribute\" at the top. The page is titled \"Our Investment ICP\" and is organized into six boxes arranged in a 2x3 grid layout.\n\nThe boxes contain the following information:\n\n1. \"Attributes\" box lists:\n- B2B Software\n- $500K-$1.5M ARR\n- Growing ARR 3x+ Y/Y\n- 100%+ NDR\n\n2. \"Price Disciplined\" box describes Stage 2's disciplined valuation approach, showing average post-money first check amounts across 45+ companies:\nFund I: $32M; Fund II: $28M; Fund III: $33M\n\n3. \"Leverage LP Value\" box explains how Stage 2 leverages LPs to access, win and diligence founders, markets, and products.\n\n4. \"First to Lead\" box states that Stage 2 takes the lead in discovering and catalyzing funding rounds.\n\n5. \"Founder-led to Team-led\" box describes target companies transitioning from founder-led selling to team-led selling.\n\n6. \"Rigorous Evaluation Framework\" box mentions Stage 2's evaluation of LIR (Leading Indicators of Retention) to assess customer value creation and engagement.\n\nThe page is professionally designed with a clean layout using a color scheme of black text with teal accents for headers. The page number 12 appears at the bottom right corner.", "Page Number: 13": "This page appears to be from a presentation by Stage 2 Capital, marked as \"CONFIDENTIAL | Do Not Distribute\" at the top. The page is titled \"Our Approach: Pod Model\" on a teal/turquoise background with a white icon in the top right corner.\n\nThe main content shows a team structure consisting of \"1 Investor + 1 GTM Practitioner = 3\" on the left side.\n\nThe page displays four professional headshots with corresponding information below each:\n\n1. Company Position: Managing Partner\n   Company: Bessemer Venture Partners\n\n2. Company Position: Managing Partner\n   Company: HubSpot\n\n3. Company Position: Partner\n   Company: NetSuite\n\n4. Company Position: Partner\n   Company: Bessemer Venture Partners\n\nAll headshots are set against a light geometric patterned background, and each person's information is displayed on a black rectangle beneath their photo.\n\nThe page number 13 appears at the bottom right corner.", "Page Number: 14": "This page appears to be from Stage 2 Capital's investment prospectus. The page is divided into two main sections:\n\nOn the left side:\n- The company logo (a black circle with a white asterisk/star symbol)\n- A headline \"We Invest in Capital-Conscious Founders Solving Real-World Challenges\"\n- A subheading stating \"We take board seats to work hand in hand with our founders to achieve efficient growth.\"\n\nOn the right side:\nA box titled \"Company & Founder ICP\" containing:\n\nCompany Attributes:\n- A teal square logo with a white asterisk/star symbol\n- B2B Software\n- $500K-$1.5M ARR\n- Growing ARR 3x+ Y/Y\n- 100%+ NDR\n\nThe box is further divided into sections:\nFounder Traits:\n- Efficient, capital-conscious\n- Deep domain expertise with a track record of execution\n- Built highly sticky software\n\nMarkets:\n- Lists diverse end-markets including construction, healthcare, logistics, financial institutions, utilities, energy, and manufacturing\n\nProduct:\n- Focused on critical operating systems with high retention (90+ GRR)\n\nGrowth Focus:\n- Aggressive but achievable with a priority on efficiency\n\nGeography:\n- All regions\n\nThe page has a \"CONFIDENTIAL | Do Not Distribute\" header and page number 14 at the bottom.", "Page Number: 15": "This page appears to be from a Stage 2 Capital presentation, marked as \"CONFIDENTIAL | Do Not Distribute\" at the top. The page is titled \"Our Model in Action: Slang\" and contains information about a hospitality-focused AI company.\n\nThe page is divided into two main sections:\n\nLeft side:\n- A text section describing Slang's achievements, noting 2x YoY growth and 100%+ NDR in the SMB market\n- \"About Slang - Hospitality\" section describing their AI software\n- \"Why It Has Potential\" section listing three bullet points about market demand, cost benefits, and partnerships\n\nRight side:\n- A graph titled \"CARR\" showing an upward trending line chart\n- The x-axis spans from Q1'22 to Q4'24\n- Shows a steady increase in what appears to be revenue or growth metrics\n- A vertical line indicates \"Stage 2 Investment\" point\n- Below the graph is a metric showing \"6.8x Growth Since Investment\"\n\nThe page uses a professional color scheme of teal/turquoise and black, with the Slang logo appearing in pink/purple. The page number 15 appears at the bottom.", "Page Number: 16": "This page appears to be from a Stage 2 Capital presentation, marked as \"CONFIDENTIAL | Do Not Distribute\" at the top. The page showcases \"Our Model in Action\" featuring Basis Theory, a fintech company.\n\nThe layout includes:\n\nLeft side:\n- A headline about Basis Theory's performance, stating they doubled revenue in six months with 3x YoY growth and 270% NDR\n- Company description as a developer-first platform for protecting sensitive data\n- Key points about empowering fintechs and merchants\n- A \"Why It Has Potential\" section discussing regulatory changes and data security opportunities\n\nRight side:\n- A graph titled \"CARR\" showing quarterly progression from Q1'22 to Q4'24 (projected)\n- The graph shows an upward trend with a marker indicating \"Stage 2 Investment\" at a specific point\n- Below the graph, a metric shows \"4.2x Growth Since Investment\"\n\nThe page uses a professional color scheme of dark blue and teal, with the Basis Theory logo incorporated. The page number 16 appears at the bottom.\n\nThe overall design is clean and corporate, typical of an investment deck, with clear sections and data visualization.", "Page Number: 17": "This page is titled \"Our Model in Action:\" with the Steelhead Technologies logo (featuring a stylized \"ST\" design in red) next to it. The page is marked as \"CONFIDENTIAL | Do Not Distribute\" in the top right corner and has the Stage 2 Capital logo in the top left.\n\nThe page contains two main sections:\n\nLeft side:\n- A text section about Steelhead, noting their 3X+ YoY growth and Series B round in Q4 2024\n- \"About Steelhead - Manufacturing SaaS\" section with three bullet points describing their platform\n- \"Why It Has Potential\" section with two bullet points about market opportunity\n\nRight side:\n- A graph titled \"ARR\" showing quarterly revenue growth from Q3'22 to Q4'24\n- The graph shows steady upward growth with a marked \"Stage 2 Investment\" point\n- Below the graph is a teal-colored box stating \"3x Growth Since Investment\"\n\nThe overall layout is clean and professional, using a color scheme of teal/blue and white, with the page number 17 at the bottom.", "Page Number: 18": "This page presents information about MedScout, featuring the Stage 2 Capital logo at the top and a \"CONFIDENTIAL | Do Not Distribute\" header.\n\nThe page layout includes:\n\nLeft side content:\n- A heading \"Our Model in Action: MedScout\" with the MedScout logo\n- A subtitle describing 2x+ YoY growth achievement\n- \"About MedScout - MedTech\" section detailing their GTM acceleration platform\n- \"Why It Has Potential\" section highlighting expansion opportunities and $100M+ ARR potential\n\nRight side:\n- A bar graph titled \"ARR\" showing quarterly progression from Q1'22 to Q4'24\n- The graph indicates a \"Stage 2 Investment\" point\n- A teal-colored box showing \"4.7x Growth Since Investment\"\n\nThe graph demonstrates an upward trend in ARR (Annual Recurring Revenue) over time, with projected growth shown in lighter shades for future quarters.\n\nThe page appears to be page 18 of the presentation, as indicated at the bottom.\n\nThe overall design uses a professional color scheme of teal/turquoise and white, maintaining a clean, corporate appearance.", "Page Number: 19": "This page appears to be from a Stage 2 Capital presentation, marked as \"CONFIDENTIAL | Do Not Distribute\" at the top. The page showcases \"Our Model in Action\" featuring Momentum, with their bow-tie logo in turquoise.\n\nThe page contains:\n- A header section describing Momentum's achievement of 2.2x YoY growth and 150% NDR\n- A section titled \"About Momentum - GTM AI\" with bullet points about their Enterprise listening capabilities and AI Data Pipeline\n- A \"Why It Has Potential\" section with two bullet points about GTM intelligence streamlining and solving GTM problems\n\nOn the right side, there's a bar graph labeled \"ARR\" showing quarterly growth from Q4'23 through Q4'24, with steadily increasing bars in a teal/dark turquoise color. Below the graph, there's a metric showing \"1.9x Growth Since Investment\" in a teal box.\n\nThe page is numbered \"19\" at the bottom right corner.\n\nThe overall design uses a clean, professional layout with a color scheme of white, turquoise, and teal, consistent with corporate presentation standards.", "Page Number: 20": "This page appears to be from a Stage 2 Capital presentation, marked as \"CONFIDENTIAL | Do Not Distribute\" at the top.\n\nThe page showcases \"Our Model in Action: DeepScribe\" with a waveform-style logo next to the DeepScribe name. The content describes how DeepScribe achieved over 67% growth by automating medical note-taking and gaining adoption among enterprise health systems.\n\nThe page is divided into two main sections:\n1. Left side contains text information including:\n- About DeepScribe - HealthTech section describing their AI-powered platform\n- Why It Has Potential section listing three bullet points about their market position and opportunities\n\n2. Right side features a graph titled \"ARR\" showing:\n- A bar chart tracking growth across quarters from Q4'20 to Q4'24\n- An arrow indicating \"Stage 2 Investment\" point\n- The bars show a clear upward trend\n- Below the graph is a metric \"10.7x Growth since Investment\" in a teal-colored box\n\nThe page uses a professional color scheme of teal/turquoise and white, with the page number 20 at the bottom.", "Page Number: 21": "This page appears to be from a Stage 2 Capital presentation marked as \"CONFIDENTIAL | Do Not Distribute\" at the top. The page focuses on \"Our Model in Action:\" featuring a company called Rally.\n\nThe layout includes:\n\nLeft side content:\n- A header describing Rally's achievement of 3x YoY growth with strong NRR and efficiency\n- \"About Rally\" section describing their Research Operations Platform\n- \"Why It Has Potential\" section highlighting product development and AI capabilities\n\nRight side:\n- A graph titled \"ARR\" showing quarterly progression from Q4'23 to Q4'24 with an upward trend\n- The graph includes a \"Stage 2 Investment\" marker\n- Below the graph is a metric showing \"4.7x Growth Since Investment\"\n\nThe color scheme primarily uses teal/dark green for the graph and accents. The page is numbered 21 at the bottom. The layout is clean and professional, typical of an investor presentation style.\n\nThe Rally logo appears to be stylized in a bold, modern typeface.", "Page Number: 22": "This page appears to be from a Stage 2 Capital presentation, marked as \"CONFIDENTIAL | Do Not Distribute\" at the top.\n\nThe page focuses on \"LP Relations\" and includes professional headshots of two Operating Partners:\n- An operating partner in a black outfit on the left, with the Vanetta company logo below\n- An operating partner in a dark polo shirt on the right, with logos for Oracle, Seismic, and Vlocity below\n\nThe right side of the page displays text describing \"A differentiated factor powering our LP base\" with three bullet points:\n- 75+ LP Advisors\n- 100+ LP Talent Referrals\n- 85% of Portfolio leveraged LP's during Due Diligence\n\nThe page has a dark background with a gradient effect, and the page number 22 appears in the bottom right corner.\n\nThe Stage 2 Capital logo appears in the top left corner in a white rectangular box.", "Page Number: 23": "This page is titled \"LP Community\" with a subtitle \"Ways to get involved\" from Stage 2 Capital, marked as \"CONFIDENTIAL | Do Not Distribute\" at the top of the page.\n\nThe page displays six different involvement opportunities, each represented by a teal-colored icon in a circular shape and arranged in a 2x3 grid format:\n\n1. Portfolio Events (coffee cup icon)\n- Description: Attend sessions hosted by Founder/CEOs showcasing product roadmap and top of mind GTM initiatives.\n\n2. Diligence Support (star-like icon)\n- Description: Assist the Investment Team during the due diligence process to assess potential investments.\n\n3. Virtual All-Access (sparkle/star burst icon)\n- Description: Join Functional Roundtables and/or All Access Events with peer LP's around top of mind GTM topics.\n\n4. LP Connections (vertical diamond pattern icon)\n- Description: Opt-in to participate in virtual 1-1 LP connections powered by Slack and Orbit.\n\n5. Portfolio Advising (triangular pattern icon)\n- Description: Engage as a formal or informal advisor to functional (CRO, CMO, CS, RevOPs) leaders within the portfolio.\n\n6. LP Meetings (headphone/arch icon)\n- Description: In-person events featuring fund updates, portfolio presentations, and LP networking.\n\nThe page number 23 appears at the bottom right corner.\n\nEach section is presented in a clean, minimalist design with bordered rectangles containing the icon, title, and description.", "Page Number: 24": "This page appears to be from a Stage 2 Capital presentation titled \"Leveraging Our Edge\" with a subtitle \"LP involvement in our process.\" The page is marked as \"CONFIDENTIAL | Do Not Distribute\" at the top.\n\nThe content is organized into three main sections:\n\n1. \"Find\"\n- Shows company logos including AptEdge, DeepScribe, QuotaPath, MedScout, and gigpro\n- Describes how LP network helps create consistent deal flow with access to top entrepreneurs\n- Includes an arrow indicating continued flow\n\n2. \"Pick & Win\"\n- Lists LPs involved in recent diligence, including executives from:\n  - 6Sense\n  - Sumo Logic\n  - Toast\n  - Smartsheet\n  - Oracle\n  - Astronomer\n  - HubSpot\n- Explains LPs' role in due diligence, market insights, and competitive analysis\n\n3. \"Support\"\n- Features four key metrics:\n  - 75+ Active Advisors\n  - 100+ Talent Referrals Facilitated\n  - 80% LP engagement with a portfolio company\n  - 100% Portfolio company engagement with an LP\n- Describes advising on capacity, territory planning, channel strategy, and hiring\n\nThe page includes a footnote about Fund IV investors and Stage 2 investors.\n\nThe design uses a professional color scheme with teal/blue as the primary color, and the layout is clean and organized with three distinct columns.", "Page Number: 25": "This page appears to be from a Stage 2 Capital presentation, titled \"LP Engagement: Formal Advisory Examples\" and is marked as \"CONFIDENTIAL | Do Not Distribute\" at the top.\n\nThe main content is presented in a table with three columns:\n- Limited Partner\n- Operating Experience\n- Portfolio Company\n\nThe table contains 7 rows showing partnerships between executives and companies:\n\n1. A VP of Global Growth Marketing from Seismic paired with AptEdge\n2. A Chief Revenue Officer from Tiled paired with MedScout\n3. A Former CRO from Marqeta paired with Cable\n4. A Former VP of Sales & Revenue from Toast paired with Sendoso\n5. A Former SVP Global Alliances from Salesforce paired with Veremark\n6. A Chief Executive Officer from L2L paired with Steelhead Technologies\n7. An SVP of Global Marketing from Deputy paired with Pear\n\nEach company is represented by their respective logos in the table.\n\nAt the bottom of the page, there is a confidentiality disclaimer in small text, and the page number \"25\" appears in the bottom right corner.", "Page Number: 26": "This page appears to be from a Stage 2 Capital presentation, titled \"LP Engagement\" with a subtitle \"Formal Advisory Examples.\" The page contains a table with three columns: \"Limited Partner,\" \"Operating Experience,\" and \"Portfolio Company.\"\n\nThe table shows seven rows of information matching Limited Partners with their previous operating experience at technology companies and their current portfolio company affiliations. Each row includes company logos for both the operating experience and portfolio companies.\n\nThe companies mentioned in the Operating Experience column include:\n- Zoominfo\n- Oracle\n- Zoom\n- OnBoard\n- Seismic\n- Guild\n- Ask Nicely\n\nThe Portfolio Companies listed include:\n- Order\n- Steelhead Technologies\n- Sendoso\n- Grapify\n- QuotaPath\n- Opus\n- AptEdge\n\nAt the bottom of the page, there is fine print disclaimer text and a page number (26) in the bottom right corner. The top right corner contains the text \"CONFIDENTIAL | Do Not Distribute\"\n\nThe entire document uses a professional color scheme with teal/green headers and maintains a clean, corporate presentation style.", "Page Number: 27": "This page is titled \"Our Team\" with the Stage 2 Capital logo at the top and \"CONFIDENTIAL | Do Not Distribute\" in the upper right corner.\n\nThe page displays a team roster showing 11 professional headshots arranged in two rows. Each headshot is accompanied by a black box containing:\n- The person's name\n- Their role/title\n- Company/organization logo\n\nTop row (left to right):\n- Managing Partner at Bessemer Venture Partners\n- Sr. Associate at Volition Capital\n- Partner at NetSuite\n- Partner at Zenefits\n- Partner at Bessemer Venture Partners\n- Managing Partner at HubSpot\n\nBottom row (left to right):\n- Operating Partner at Vanetta\n- Head of Marketing at Virtualitics\n- Operating Partner at Oracle\n- Chief of Staff at RapidD\n- Partner, Catalyst at Bank of America Merrill Lynch\n\nAll individuals are shown in professional business attire against a light background. The page number \"27\" appears in the bottom right corner.", "Page Number: 28": "This page is titled \"Fund IV Overview\" with the \"STAGE 2 CAPITAL\" logo at the top and a \"CONFIDENTIAL | Do Not Distribute\" header in the top right corner.\n\nThe page consists of a simple, clean layout with teal/dark green colored bars on the left containing category labels, paired with corresponding information on the right. The categories and their information are:\n\n1. Target Fund Size & Timing: $150M / Sept 2024 first close\n2. Target Fund Construction: 350+ GTM LPs (150 New), 10+ Family Offices, 5+ Institutions\n3. Fund Admin/Law Firm/Audit Firm: Carta (Fund Admin), Cooley LLP (Legal), RicheyMay (Tax), Frank Rimerman (Audit)\n4. Portfolio Construction: 18-22 investments, 70% first checks, 30% follow on checks\n5. Proposed Capital Call Schedule: 25% 2025, 25% 2026, 25% 2027, 15% 2028, 10% 2029\n6. Proposed Fund Terms: 5 year investment period, 10 yr fund life plus extensions, 2/20 fee structure, European waterfall\n\nThe page number \"28\" appears in the bottom right corner.", "Page Number: 29": "The page shows a simple title slide with the word \"APPENDIX\" in large, light blue or white serif font against a black background. In the bottom right corner is a logo or text that reads \"STAGE 2 CAPITAL\". The top right corner contains text that reads \"CONFIDENTIAL | Do Not Distribute\". The page has a subtle dark gradient effect in the lower portion, transitioning from black to a very dark teal or blue-green color.", "Page Number: 30": "This page appears to be from a Stage 2 Capital presentation, marked as \"CONFIDENTIAL | Do Not Distribute\" at the top. The page showcases the \"Stage 2 Catalyst Fund\" with the subtitle \"Early Stage Investment with Practical GTM Support.\"\n\nThe layout includes three key bullet points on the left side:\n- 15 company cohort - attending 11-week tactical GTM curriculum\n- $150k investment on a SAFE\n- Support from ~300 Catalyst LPs\n\nOn the right side, there is a section titled \"Examples Portfolio Companies:\" which displays logos of 15 companies arranged in a grid:\n- Top row: Bloomfilter, Day.ai, SAVVI AI, BOUNTI, AUQUAN\n- Middle row: StartProto, nodaFi, MLtwist, BEVZ, Atomus\n- Bottom row: AskEdith, MedScout, Revenue Roll, Persana AI, EmployeeCycle\n\nAt the bottom of the page, there is a small disclaimer text in gray and the page number \"30\".\n\nThe page uses a teal/turquoise color scheme for the header section and maintains a clean, professional design throughout.", "Page Number: 31": "This page appears to be from a Stage 2 Capital presentation titled \"At the Core: Science of Scaling\" and is marked as confidential. The page contains a process flow diagram showing three connected phases:\n\n1. Product Market Fit (shown in purple)\n2. Go-To-Market Fit (shown in teal)\n3. Growth and Moat (shown in light blue)\n\nBelow this diagram are three text boxes explaining each phase:\n- Product-market fit is described as ensuring products meet market needs using data for scaling decisions\n- Go-to-market fit focuses on creating repeatable, scalable sales and marketing engines\n- Growth and Moat emphasizes efficient and sustainable growth\n\nAt the bottom of the page are two additional sections:\n1. \"Playbooks and Toolkits\" (shown in a gray box)\n2. \"LP Advisory Support and Coaching\" (shown in a blue-green box)\n\nThe page includes header text indicating this is about how Science of Scaling underpins Stage 2 Capital's investment approach. The page number 31 appears at the bottom.", "Page Number: 32": "This page appears to be from a Stage 2 Capital presentation, marked as \"CONFIDENTIAL | Do Not Distribute\" at the top. The page focuses on \"GTM Expertise Post Investment\" support.\n\nThe main visual is a horizontal process flow diagram showing four phases:\n1. GTM Assessment (in purple)\n2. Alignment (in teal)\n3. Scale Preparation (in light blue)\n4. Scale Acceleration (in white)\n\nUnder each phase, there are detailed descriptions:\n- Phase 1: \"Evaluate Starting Point\" - Comprehensive assessment and recommendations of company's GTM opportunities\n- Phase 2: \"Define the Plan\" - Clear priority and OKR setting to execute necessary actions\n- Phase 3: \"Implement the Plan\" - Build bottoms up GTM plan with KPI reporting and establish scaling speedometer\n- Phase 4: \"Hit Goals Consistently\" - Execute go forward plan around revenue growth, retention, and efficiency\n\nAt the bottom of the page, there's an icon (appearing to be an asterisk or star symbol) followed by text stating \"800+ LPs to support our portfolio companies across multiple disciplines\"\n\nThe page number 32 appears in the bottom right corner.\n\nThe overall design uses a professional color scheme of teals, purples, and whites, with clean typography and corporate styling.", "Page Number: 33": "This page is from a Stage 2 Capital presentation titled \"Portfolio Performance\" for Fund I 2018-2019 Deployment Vintage. The page is marked as \"CONFIDENTIAL | Do Not Distribute\" at the top right.\n\nThe main content features a bar graph titled \"ARR at Time of Investment v Q3 2024 ARR* by Cash Runway.\" The graph shows two sets of bars:\n- Orange bars representing \"ARR at Time of Investment\"\n- Teal bars representing \"Q3 2024 ARR\"\n\nThe x-axis is divided into four runway categories:\n- <6 mos\n- 6-12 mos\n- 12-24 mos\n- CF+\n\nThe y-axis shows dollar values ranging from $0 to $40,000,000.\n\nThe graph demonstrates varying levels of ARR growth across different runway periods, with the most substantial growth shown in the 12-24 month runway category, where the Q3 2024 ARR bar reaches approximately $33,000,000.\n\nThe page number \"33\" appears at the bottom right corner.", "Page Number: 34": "This is page 34 of a confidential document from Stage 2 Capital titled \"Portfolio Performance\" for Fund II 2020-2022 Deployment Vintage. The page contains a bar graph showing \"ARR at Time of Investment v Q3 2024 ARR* by Cash Runway.\"\n\nThe graph compares two metrics across different runway periods:\n- Orange bars represent \"ARR at Time of Investment\"\n- Dark teal bars represent \"Q3 2024 ARR\"\n\nThe y-axis shows dollar values ranging from $0 to $12,500,000 in ARR (Annual Recurring Revenue).\nThe x-axis is divided into five runway categories:\n- <6 mos\n- 6-12 mos\n- 12-24 mos\n- 24+ mos\n- CF+\n\nThe graph shows varying levels of growth between initial investment and Q3 2024, with some companies showing significant increases in ARR, particularly in the 24+ months category where one company reaches nearly $12.5M in Q3 2024 ARR.\n\nThere's a footnote indicating \"*Excludes pre-seed deals\"\n\nThe document header includes a \"CONFIDENTIAL | Do Not Distribute\" notice.", "Page Number: 35": "This page is from a Stage 2 Capital portfolio performance presentation, marked as \"CONFIDENTIAL | Do Not Distribute\" at the top. The page shows performance data for Fund III 2020-2024 (ongoing) Deployment Vintage.\n\nThe main element is a bar graph titled \"ARR at Time of Investment v Q3 2024 ARR* by Cash Runway\" with the following characteristics:\n\n- The y-axis shows values from $0 to $8,000,000 in ARR (Annual Recurring Revenue)\n- The x-axis is divided into four runway periods: <6mos, 6-12 mos, 12-24 mos, and 24+ mos\n- Each period contains multiple paired bars comparing:\n  - Orange bars: ARR at Time of Investment\n  - Dark teal bars: Q3 2024 ARR\n\nThe graph shows generally higher Q3 2024 ARR values compared to the initial investment ARR across all time periods, with the highest single bar reaching approximately $6,000,000 in the 6-12 months category.\n\nA footnote indicates \"*Excludes pre-seed & cross fund deals\"\n\nThe page number 35 appears at the bottom.", "Page Number: 36": "This appears to be the final slide of a presentation from Stage 2 Capital. The slide has a teal/turquoise gradient background with a subtle geometric pattern of small lines forming triangular or honeycomb shapes on the right side. The text \"Thank you.\" appears in large white serif font in the center-left portion of the slide. In the top left corner is the Stage 2 Capital logo in white. The top right corner contains the text \"CONFIDENTIAL | Do Not Distribute\" also in white. The number \"36\" appears in the bottom right corner, suggesting this is slide 36 of the presentation."}, "Stage 2 Capital Performance Overview.pdf": {"Page Number: 1": "This appears to be a cover or title slide of a presentation with a dark, professional design. The background features a subtle geometric pattern of interconnected lines forming hexagonal shapes on a deep teal or blue-green gradient. The Stage 2 Capital logo appears in the top left corner as a simple white text in a rectangular border. The main text \"Data Room Follow Up\" is displayed prominently in large, light blue or white serif font in the center of the slide. Below this is \"Q1 2025\" in a similar but smaller font. The slide includes \"CONFIDENTIAL | Do Not Distribute\" text in both the top right corner and header. At the bottom of the slide is a footer that reads \"Stage 2 Capital Data Room Follow Up.\"", "Page Number: 2": "The page appears to be a disclaimer page from an investment document with the following visual elements:\n\n1. The Stage 2 Capital logo appears in the top left corner - it's a simple black rectangular design with the company name in it\n\n2. In the top right corner, there is text that reads \"CONFIDENTIAL | Do Not Distribute\"\n\n3. The word \"Disclaimer\" appears as a large heading\n\n4. The rest of the page consists of dense legal text organized in several paragraphs, all in a standard professional font\n\n5. At the bottom of the page, there is a footer that reads \"Stage 2 Capital Data Room Follow Up\" and the page number \"2\"\n\nThe layout is clean and professional, with substantial margins and consistent spacing between paragraphs. The overall design is minimal and business-focused, using only black text on a white background.", "Page Number: 3": "This appears to be a title/cover slide of a presentation with a teal/turquoise gradient background. There is a faint mountain silhouette visible in the background on the right side. The main title \"Check Size & Ownership across Funds\" appears in large white text, with a subtitle below it reading \"Deal Type Evolution\" in a lighter shade. The top and bottom of the slide contain header and footer elements: \"CONFIDENTIAL | Do Not Distribute\" appears in the top right corner, and the \"STAGE 2 CAPITAL\" logo is positioned in the bottom right corner. The layout is clean and professional, using a modern typography style typical of financial presentations.", "Page Number: 4": "This page appears to be from Stage 2 Capital's confidential data room documentation, specifically from \"Fund I\". The page shows investment data through two scatter plot graphs:\n\n1. Left Graph - \"Size of First Check\":\n- Y-axis ranges from $0 to $1,000,000\n- Most data points cluster between $500K-$750K (highlighted in light blue)\n- Shows approximately 7-8 individual investment points\n- X-axis appears to represent different investments (though not explicitly labeled)\n\n2. Right Graph - \"Current Ownership\":\n- Y-axis ranges from 0% to 5%\n- Most data points fall between 1%-3% ownership (highlighted in light blue)\n- Shows approximately 8 individual investment points\n- X-axis appears to represent different investments (though not explicitly labeled)\n\nThe page header indicates:\n- \"First check: $500K-$750K\"\n- \"Ownership: 1%-3%\"\n- Title: \"First investment and current ownership (inclusive of follow on round dilution)\"\n\nThe page includes the Stage 2 Capital logo in the top left corner and has \"CONFIDENTIAL | Do Not Distribute\" marked in the top right corner. The page number 4 appears in both the top right and bottom right corners.", "Page Number: 5": "This page is titled \"Fund II\" with the Stage 2 Capital logo in the top left corner and a \"CONFIDENTIAL | Do Not Distribute\" header in the top right.\n\nThe page shows investment statistics with two main metrics:\n- First check: $1.5M-$3.5M\n- Ownership: 8%-12%\n\nThere are two scatter plot graphs:\n\n1. \"Size of First Check\" graph:\n- Y-axis ranges from $0 to $5,000,000\n- Shows multiple data points scattered between roughly $1M-$4M\n- Has a light blue shaded band indicating the target range\n- Most points cluster between $2M-$3.5M\n\n2. \"Current Ownership\" graph:\n- Y-axis ranges from 0% to 25%\n- Shows ownership percentages as scattered points\n- Has a light blue shaded band indicating the target range\n- Most points cluster between 8%-12%, with some outliers up to about 23%\n\nAt the bottom of the page, there's a footnote stating \"*Excludes pre-seed deals\" and \"Stage 2 Capital Data Room Follow Up\" with page number 5.\n\nThe overall layout is clean and professional, using a blue and white color scheme that matches the Stage 2 Capital branding.", "Page Number: 6": "This page is from a confidential Stage 2 Capital presentation about Fund III. The page contains two main scatter plot graphs:\n\n1. Left Graph - \"Size of first check\"\n- Y-axis ranges from $0 to $8,000,000\n- Shows scattered data points mostly falling within a highlighted range of $3M-$6M\n- Data points represent individual investments\n- A light blue shaded area indicates the target investment range\n\n2. Right Graph - \"Current Ownership\"\n- Y-axis ranges from 0.00% to 20.00%\n- Shows ownership percentages with data points mostly falling within 10%-17%\n- Data points represent ownership stakes\n- A light blue shaded area indicates the target ownership range\n\nThe page header indicates \"Fund III\" and states \"First investment and current ownership (inclusive of follow on round dilution)*\"\n\nKey metrics are highlighted:\n- First check: $3M-$6M\n- Ownership: 10%-17%\n\nAt the bottom of the page, there's a footnote: \"*Excludes cross-fund deals\"\n\nThe page is marked as \"CONFIDENTIAL | Do Not Distribute\" and numbered as page 6, with \"Stage 2 Capital Data Room Follow Up\" at the bottom.", "Page Number: 7": "This appears to be a title/cover slide of a presentation with a teal/turquoise gradient background. The main title \"Fund Performance\" is displayed prominently in large white text, with a subtitle below it reading \"Evaluating performance from ARR Growth\". In the top right and left corners, there is text that reads \"CONFIDENTIAL | Do Not Distribute\". In the bottom right corner is a logo or wordmark reading \"STAGE 2 CAPITAL\". The background includes a subtle image of what appears to be a mountain peak in a darker teal shade.", "Page Number: 8": "This page appears to be from a venture capital or investment presentation by Stage 2 Capital. It's titled \"Portfolio Performance\" and subtitled \"Fund I 2018 - 2019 Deployment Vintage.\"\n\nThe main content features a bar graph titled \"ARR at Time of Investment v Q4 2024 ARR* by Cash Runway.\" The graph has three main categories on the x-axis showing different runway periods: \"<6 mos\", \"12-24 mos\", and \"CF+\" (presumably cash flow positive).\n\nEach category contains paired bars:\n- Orange bars representing \"ARR at Time of Investment\"\n- Teal/dark blue bars representing \"Q4 2024 ARR\"\n\nThe y-axis shows dollar values ranging from $0 to $30,000,000.\n\nThe graph demonstrates growth between initial investment and projected Q4 2024 ARR across different runway categories. The highest projected ARR appears in the 12-24 month runway category, reaching nearly $30 million. Companies with longer runways (CF+) show more moderate projections, while those with shorter runways (<6 mos) show the smallest projections.\n\nThe page includes a \"CONFIDENTIAL | Do Not Distribute\" header and appears to be page 8 of the presentation, as indicated by the footer.", "Page Number: 9": "This page appears to be from a Stage 2 Capital investment presentation, labeled as \"CONFIDENTIAL | Do Not Distribute\" at the top. The page is numbered 9 and titled \"Portfolio Performance\" with a subtitle \"Fund II 2020 - 2022 Deployment Vintage.\"\n\nThe main element of the page is a bar graph titled \"ARR at Time of Investment v Q4 2024 ARR* by Cash Runway.\" The graph shows two sets of bars:\n- Orange bars representing \"ARR at Time of Investment\"\n- Dark teal bars representing \"Q4 2024 ARR\"\n\nThe y-axis shows dollar amounts ranging from $0 to $15,000,000.\nThe x-axis is divided into five runway categories:\n- <6 mos\n- 6-12 mos\n- 12-24 mos\n- 24+ mos\n- CF+\n\nThe graph shows multiple data points within each runway category, with the Q4 2024 ARR generally showing higher values than the ARR at Time of Investment. The highest bar appears in the \"24+ mos\" category, reaching approximately $15,000,000.\n\nAt the bottom of the graph, there's a note stating \"*Excludes pre-seed deals\"\n\nThe Stage 2 Capital logo appears in the top left corner of the page.", "Page Number: 10": "This page shows a performance analysis slide from Stage 2 Capital's Fund III covering 2022-2024 (ongoing) Deployment Vintage. The page is marked as \"CONFIDENTIAL | Do Not Distribute\" at the top.\n\nThe main content features a bar graph titled \"ARR at Time of Investment v Q4 2024 ARR* by Cash Runway\". The graph displays data on the y-axis in increments from $0 to $8,000,000 in terms of ARR (Annual Recurring Revenue).\n\nThe x-axis is divided into four runway periods:\n- <6mos\n- 6-12 mos\n- 12-24 mos\n- 24+ mos\n\nEach period shows multiple company comparisons with two bars per company:\n- Orange bars representing \"ARR at Time of Investment\"\n- Dark teal bars representing \"Q4 2024 ARR\"\n\nThe graph indicates significant growth across most companies, with some showing particularly dramatic increases from initial investment to projected Q4 2024 ARR. The highest single bar reaches approximately $7,000,000 in the <6mos category.\n\nAt the bottom of the graph, there's a footnote stating \"*Excludes pre-seed & cross fund deals\"\n\nThe page number \"10\" appears at the bottom right corner.", "Page Number: 11": "This appears to be a title slide or cover page of a presentation with a teal/turquoise gradient background. In the foreground, there is white text displaying \"Stage 2's Impact\" as the main title, with \"Select Examples\" as a subtitle in a lighter or more muted font. The text is positioned in the left portion of the slide. In the background, there appears to be a faint mountain peak silhouette on the right side. At the top and bottom of the slide, there are \"CONFIDENTIAL | Do Not Distribute\" headers, and in the bottom right corner, there is a \"STAGE 2 CAPITAL\" logo or wordmark in a white rectangular border.", "Page Number: 12": "This page appears to be from a Stage 2 Capital Data Room presentation, marked as \"CONFIDENTIAL | Do Not Distribute\" at the top. The page features the AptEdge company logo and contains two main sections highlighting business improvements:\n\n1. The first section titled \"Implementing LIR\" shows a before-and-after comparison with a teal arrow graphic:\n- Before: CS/AM Team qualitatively assessed churn risk through manual calls to customers\n- Change: Implementation of LIR tracker for weekly quantitative measurement of customer health\n- Results/Impact: 50-90% reduction in CS team time spent identifying at-risk customers while maintaining <5% annual churn\n\n2. The second section titled \"Improving Close Rate\" also uses a teal arrow graphic to show:\n- Before: Sales team ran unqualified POCs and had to re-sell pilot to paid customer conversions\n- Change: Stage 2 introduced \"success criteria\" to POC process for auto-conversion based on defined triggers/milestones\n- Results/Impact: 2x improvement in conversion rate from pilot to paid after implementing success criteria\n\nThe page uses a clean, professional design with teal and white color scheme, and includes page number 12 at the bottom. The Stage 2 Capital logo appears in the upper left corner.", "Page Number: 13": "This page appears to be from a Stage 2 Capital presentation, labeled as \"CONFIDENTIAL | Do Not Distribute\" at the top. The page contains the MedScout company logo and two main sections presented in a before/change/results format.\n\nThe first section titled \"Accelerating Pipeline\" is represented by a teal arrow graphic and shows:\n- Before: Information about reps not hitting quota due to lack of demand generation\n- Change: Details about hiring Head of Marketing and AEs\n- Results: 385% improvement from Dec to Feb with doubled opportunities\n\nThe second section titled \"Decreasing Churn with CS\" also uses a teal arrow graphic and shows:\n- Before: Information about unqualified POCs\n- Change: Introduction of success criteria\n- Results: 2 accounts remaining in H1 2024\n\nThe layout uses a professional corporate design with teal and white color scheme. Each section is clearly delineated with arrows and contains three columns for Before, Change, and Results/Impact. The page number 13 appears at the bottom along with \"Stage 2 Capital Data Room Follow Up\" text.\n\nThe formatting is clean and modern, with clear typography and consistent spacing throughout. All text is presented against either a dark background (top section) or light purple background (bottom section).", "Page Number: 14": "This page appears to be from a Stage 2 Capital presentation titled \"CONFIDENTIAL | Do Not Distribute\". The page features the Stage 2 Capital logo at the top and an \"Opus\" logo beneath it.\n\nThe content is organized into two main sections, each with a before/change/results format using teal-colored arrows as visual indicators:\n\n1. \"Improving Sales Efficiency\" section:\n- Before: Details about having only one salesperson\n- Change: Information about realigning sales capacity\n- Results/Impact: Shows \"20-11\" as a key metric, representing improvement in CAC payback from 20 to 11 months\n\n2. \"GTM Ops & Data Visibility\" section:\n- Before: Notes about lack of GTM data visibility\n- Change: Description of implementing Bottoms Up model and Rev Ops\n- Results/Impact: Details about removing duplicate work\n\nThe layout uses a professional corporate design with a dark background for the top section and a light purple/blue background for the bottom section. Text is presented in white and teal colors, with orange highlights for \"Results/Impact\" headers.\n\nThe page number \"14\" appears at the bottom right, along with \"Stage 2 Capital Data Room Follow Up\".\n\nThe overall design is clean and professional, using a consistent color scheme and clear visual hierarchy to present the information about business improvements and metrics.", "Page Number: 15": "This page appears to be from a Stage 2 Capital presentation or data room document, marked as \"CONFIDENTIAL | Do Not Distribute\". The page features the Stage 2 Capital logo at the top and the AeroCloud company logo below it.\n\nThe content is organized into two main sections, each using a teal-colored arrow design to show progression from \"Before\" to \"Change\" to \"Results/Impact\":\n\n1. First Section - \"Implementing a Sales Methodology\":\n- Before: Notes lack of sales process and qualification methodology\n- Change: Describes implementation of MEDDPICC\n- Results/Impact: Shows \"~50%\" statistic regarding removal of unqualified pipeline\n\n2. Second Section - \"GTM Ops & Data Visibility\":\n- Before: Describes issues with junior GTM team organization\n- Change: Details team reorganization around target account strategy\n- Results/Impact: Shows \">30%\" statistic regarding improved discovery to close conversion rates\n\nThe layout uses a clean, professional design with consistent typography and color scheme (primarily teal, black, and white). The page number \"15\" appears at the bottom along with \"Stage 2 Capital Data Room Follow Up\".\n\nThe overall design is minimalist and business-focused, using arrows and clear headings to show progression and improvement in key metrics.", "Page Number: 16": "This page appears to be from a Stage 2 Capital presentation, marked as \"CONFIDENTIAL | Do Not Distribute\" at the top. The page shows two main sections that follow a \"Before -> Change -> Results/Impact\" format, presented with teal colored arrows and clean typography.\n\nThe Slang company logo appears near the top of the page in pink/purple gradient colors.\n\nThe first section titled \"Scaling Outbound Channel\" is displayed on a dark background and shows the progression from a single marketing manager situation through Stage 2's recommendations to the final results of hiring 6 BDRs.\n\nThe second section titled \"Refining ICP\" is shown on a light purple/lavender background and details changes from Q4 '23 through Q2 '24, including shifts in strategy and resulting revenue metrics.\n\nThe page is numbered \"16\" and includes the \"Stage 2 Capital Data Room Follow Up\" footer. The layout is clean and professional, using a consistent design system with arrows to show progression and clear sectioning to separate the two main topics.\n\nBoth sections use a similar three-column layout structure to show the progression from initial state through changes to final results/impact, creating a clear visual narrative of the business changes and their outcomes.", "Page Number: 17": "This appears to be the final \"Thank you\" slide of a presentation. The slide has a dark, nearly black background with diagonal blue/teal lines creating a pattern in the upper right portion. The text \"Thank you\" appears in large, white serif font on the left side. In the bottom right corner is the \"STAGE 2 CAPITAL\" logo in white text within a rectangular border. At the very top of the slide, there is a header that reads \"CONFIDENTIAL | Do Not Distribute\" in white text."}, "Stage 2 Capital Portfolio Highlights.pdf": {"Page Number: 1": "This appears to be the title/cover slide of a presentation titled \"Portfolio Case Studies\" from Stage 2 Capital. The slide has a deep teal/turquoise background color with a subtle geometric pattern of intersecting lines or hexagons in the background. The Stage 2 Capital logo appears in the top left corner as a white text/graphic element. In the top right corner, there is text that reads \"CONFIDENTIAL | Do Not Distribute\". The main title \"Portfolio Case Studies\" is displayed in large white serif font in the middle-left portion of the slide. The number \"1\" appears in the bottom right corner, indicating this is the first slide of the presentation.", "Page Number: 2": "This page appears to be from a Stage 2 Capital investment presentation, marked as \"CONFIDENTIAL | Do Not Distribute\" at the top. The page focuses on \"Our Model in Action: Slang\" with the Slang logo styled in purple.\n\nThe page contains two main sections:\n\n1. Left side text content describing Slang, a hospitality AI software company, including:\n- A header about their GTM team scaling and growth metrics\n- Information about the company and its potential\n- Details about their partnerships and value proposition\n\n2. Right side contains a graph titled \"CARR\" (presumably Customer Annual Recurring Revenue) showing:\n- A line chart tracking growth from Q1'22 to Q4'24\n- Y-axis values ranging from $0 to $5,000,000\n- A vertical blue line indicating \"Stage 2 Investment\" point\n- An upward trending curve showing growth\n- A blue box at the bottom stating \"6.8x Growth Since Investment\"\n\nThe page uses a clean, professional design with a white background and Stage 2 Capital's logo in the top left corner. The color scheme primarily uses teal/blue colors for emphasis and graphics.\n\nPage number \"2\" appears at the bottom right corner.", "Page Number: 3": "This page appears to be from a Stage 2 Capital investment presentation, marked as \"CONFIDENTIAL | Do Not Distribute\" at the top. The page showcases \"Our Model in Action\" featuring Basis Theory, with their logo displayed.\n\nThe page contains two main sections:\n1. Text content on the left describing Basis Theory's performance and business model\n2. A large graph on the right titled \"CARR\" showing ARR (Annual Recurring Revenue)\n\nThe graph is a line chart showing financial growth from Q1'22 to Q4'24 (projected), with values ranging from $0 to $5,000,000. There's a vertical marker indicating \"Stage 2 Investment\" on the timeline, and the graph shows steady upward growth. Below the graph is a teal-colored box stating \"4.2x Growth Since Investment.\"\n\nThe overall layout is professional, using a clean design with a color scheme of white, teal, and dark blue. The Stage 2 Capital logo appears in the top left corner of the page, and page number 3 is visible at the bottom.\n\nThe presentation uses a clear hierarchical structure with headers, bullet points, and well-organized information about Basis Theory's business model, growth metrics, and potential.", "Page Number: 4": "This page appears to be from a Stage 2 Capital presentation, marked as \"CONFIDENTIAL | Do Not Distribute\" at the top. The page features a case study titled \"Our Model in Action\" focusing on Steelhead Technologies.\n\nThe layout includes:\n\n1. The Steelhead Technologies logo\n2. A description section detailing the company's growth (3X+ YoY) and Series B funding in Q4 2024\n3. Two text sections:\n   - \"About Steelhead - Manufacturing SaaS\" with three bullet points\n   - \"Why It Has Potential\" with two bullet points\n\nThe right side of the page contains a graph titled \"ARR\" showing:\n- A bar chart tracking growth from Q3'22 to Q4'24\n- Y-axis values ranging from $0 to $4,000,000\n- A vertical line indicating \"Stage 2 Investment\"\n- Steadily increasing bar heights showing growth\n- A teal-colored box below stating \"3x Growth Since Investment\"\n\nThe page is numbered \"4\" at the bottom and maintains a professional business presentation format with consistent font usage and corporate styling.", "Page Number: 5": "This page appears to be from a Stage 2 Capital investment presentation, marked as \"CONFIDENTIAL | Do Not Distribute\" at the top. The page showcases \"Our Model in Action\" featuring MedScout as a case study.\n\nThe page contains two main visual elements:\n\n1. The MedScout logo - a teal/turquoise colored stylized design.\n\n2. A graph titled \"ARR\" showing quarterly revenue growth from Q1'22 to Q4'24 (projected). The graph is a bar chart with ascending bars in a dark teal color, showing growth from near $0 to approximately $4,000,000. It includes a vertical line indicating \"Stage 2 Investment\" and shows \"4.7x Growth Since Investment\" in a teal box below the chart.\n\nThe rest of the page contains text organized in three sections:\n- A header describing MedScout's 2x+ YoY growth\n- \"About MedScout - MedTech\" section detailing their GTM acceleration platform\n- \"Why It Has Potential\" section outlining growth opportunities and $100M+ ARR potential\n\nThe page is numbered as page 5 at the bottom and uses a professional business presentation layout with a clean, modern design in primarily teal and black colors.", "Page Number: 6": "This page appears to be from an investment deck or presentation, with the Stage 2 Capital logo in the top left and \"CONFIDENTIAL | Do Not Distribute\" in the top right.\n\nThe page showcases \"Our Model in Action\" featuring Momentum (with their teal logo) and contains several key elements:\n\nA main text section describing Momentum's achievement of 2.2x YoY growth and 150% NDR, followed by two informational sections:\n\n1. \"About Momentum - GTM AI\" section detailing their enterprise listening capabilities and AI Data Pipeline\n2. \"Why It Has Potential\" section outlining their GTM intelligence streamlining and problem-solving capabilities\n\nThe right side of the page features a bar graph titled \"ARR\" showing Stage 2 Investment growth over five quarters (Q4 '23 through Q4 '24), with values ranging from approximately $500,000 to $2,000,000. Below the graph is a metric showing \"1.9x Growth Since Investment\" in a teal-colored box.\n\nThe page is primarily designed in a professional layout using teal/turquoise as the main accent color, with clean typography and corporate styling. The page number 6 appears at the bottom.", "Page Number: 7": "This page appears to be from a Stage 2 Capital investment presentation, marked as \"CONFIDENTIAL | Do Not Distribute\" at the top. The page features a case study titled \"Our Model in Action:\" focusing on DeepScribe (with their logo).\n\nThe page is divided into two main sections:\n\nLeft side:\n- A text section describing DeepScribe as a HealthTech company\n- Bullet points about the company's AI-powered platform and potential\n- Details about their growth, customers, and strategic opportunities\n\nRight side:\n- A graph showing ARR (Annual Recurring Revenue) growth\n- The graph shows quarterly data from Q4'20 through Q4'24\n- A vertical line indicates \"Stage 2 Investment\" point\n- Y-axis shows values from $0 to $15,000,000\n- The trend line shows steady growth over time\n- Below the graph is a metric showing \"10.7x Growth since Investment\"\n\nThe page uses a professional business presentation design with a white background and teal/blue color scheme for emphasis. The page number \"7\" appears at the bottom.\n\nThe overall layout is clean and corporate, using a consistent font and color scheme throughout, with clear separation between text and visual elements.", "Page Number: 8": "This page appears to be from an investment deck for Stage 2 Capital, marked as \"CONFIDENTIAL | Do Not Distribute\" at the top. The page showcases a case study titled \"Our Model in Action:\" featuring a company called Rally.\n\nThe page has two main sections:\n1. A text section on the left containing:\n- A headline about achieving 3x YoY growth\n- Information about Rally's platform and potential\n- Details about their Research Operations Platform and comprehensive features\n- Information about their product development and AI capabilities\n\n2. A graph on the right labeled \"ARR\" showing:\n- A bar chart displaying financial growth from Q4 '23 to Q4 '24\n- Values ranging from $0 to $2,000,000 on the y-axis\n- A marking indicating \"Stage 2 Investment\"\n- An upward trend in the bars\n- A callout box showing \"4.7x Growth Since Investment\"\n\nThe page uses a professional color scheme of dark teal/blue and white, with the Stage 2 Capital logo in the top left corner. The layout is clean and corporate, with clear sections and professional typography. The page number 9 appears at the bottom.", "Page Number: 9": "This page appears to be from a Stage 2 Capital investment presentation, marked as \"CONFIDENTIAL | Do Not Distribute\" at the top. The page focuses on \"Our Model in Action\" featuring QuotaPath (with their logo shown).\n\nThe page contains two main sections:\n1. A text section on the left describing QuotaPath's business and potential\n2. A graph on the right showing ARR (Annual Recurring Revenue) growth\n\nThe graph is a bar chart showing quarterly revenue progression from Q3'21 through Q4'24, with:\n- Y-axis ranging from $0 to $8,000,000\n- A vertical line indicating \"Stage 2 Investment\" point\n- Dark teal colored bars showing increasing revenue\n- A highlighted \"13.2x Growth since Investment\" metric at the bottom\n\nThe page is professionally designed with a clean layout using a color scheme of teal, white, and black. The Stage 2 Capital logo appears in the top left corner, and the page number (10) is at the bottom.\n\nThe information is organized with clear headings including \"About QuotaPath - Commission Management\" and \"Why It Has Potential,\" with bullet points detailing business information and strategic opportunities."}, "Value Add_ GTM Support Methodologies.pdf": {"Page Number: 1": "This appears to be a title or cover slide from a presentation with a clean, minimalist design. At the top of the page is the text \"STAGE 2 CAPITAL\" in a simple black font within a rectangular border. The main title \"Value Add & GTM Support Methodologies\" appears in the center of the page in a large, bold font. There is a small turquoise accent line above the title text. In the bottom right corner, there appears to be a small turquoise chevron or arrow symbol. A thin turquoise horizontal line runs along the bottom edge of the slide. The overall color scheme consists of black text on a white background with turquoise accent elements.", "Page Number: 2": "This page appears to be from a Stage 2 Capital presentation, as indicated by their logo in the top right corner. The page outlines their GTM (Go-To-Market) Expertise Post Investment support process.\n\nThe main visual is a horizontal workflow diagram showing four connected phases, represented by chevron-shaped arrows in different colors (orange, dark gray, turquoise, and teal). The phases are labeled:\n1. GTM Assessment\n2. Alignment\n3. Scale Preparation\n4. Scale Acceleration\n\nBelow this workflow, each phase is detailed:\n- Phase 1: \"Evaluate Starting Point\" - Describes comprehensive assessment and recommendations\n- Phase 2: \"Define the Plan\" - Focuses on priority and OKR setting\n- Phase 3: \"Implement the Plan\" - Covers building GTM plan with KPI reporting\n- Phase 4: \"Hit Goals Consistently\" - Details executing revenue growth plans\n\nAt the bottom of the page, there's a notable statistic highlighting \"500+ LPs to support our portfolio companies across multiple disciplines\"\n\nThe page has a clean, professional design with a white background and includes a \"Confidential | Do not distribute\" disclaimer at the bottom.\n\nThe title at the top reads \"Support: GTM Expertise Post Investment\" with a subtitle \"Leveraging Pods / LPs / Frameworks / Playbooks\"", "Page Number: 3": "This appears to be a slide from a presentation titled \"Applying our GTM Thesis\" with the Stage 2 Capital logo in the top right corner. The slide is organized into two main sections:\n\n1. \"Early Support: Pre and Post Investment\" which contains three boxes:\n- Investment Memo (Summary of diligence with GTM lens)\n- GTM Assessment (Deep dive on current state and recommendations)\n- Leading Indicators of Retention (Signals for product market fit)\n\n2. \"Ongoing Support\" which contains five boxes:\n- GTM Scorecard (KPIs to focus on each quarter)\n- Bottoms Up Model (Unit economics of rep success)\n- Annual Planning (BU model with financial targets)\n- Big Bet (Strategic initiative to drive growth)\n- Fundraising Scorecard (Fundraising planning tool)\n\nThe boxes are arranged in a hierarchical flow chart style with turquoise borders. At the bottom of the slide, there is a note stating \"Confidential | Do not distribute\".\n\nThe design is clean and minimalist, using a white background with black text and turquoise accents for the box borders.", "Page Number: 4": "This page appears to be from a presentation by Stage 2 Capital (whose logo appears in the top right corner). The page is titled \"Applying our GTM Thesis\" with a subtitle \"Pre-Investment\" and a section on \"Investment Memo.\"\n\nThe page contains primarily text explaining their investment memo process, followed by a simple table with four rows and three columns. The table has a teal/turquoise colored header row and shows \"Recent Examples\" of investment memos.\n\nThe table columns are labeled:\n- Fund\n- Company\n- Investment Memo\n\nAll rows list \"Fund III\" in the first column, with different companies (Steelhead, AptEdge, Medscout, and Cable) in the second column. The third column contains hyperlinks labeled \"Memo here\" for each row.\n\nThe page has a footer noting \"Confidential | Do not distribute\" in small text.\n\nThe overall design is clean and professional, using a white background with black text and teal/turquoise accents for the table header and hyperlinks.", "Page Number: 5": "This page appears to be from a presentation deck titled \"Applying our GTM Thesis\" with a \"Post-Investment\" subtitle. The Stage 2 Capital logo appears in the top right corner. The page has a clean, professional layout with a white background and turquoise accent colors.\n\nThe main content describes a GTM Assessment process, followed by a simple table with four rows showing examples. The table has three columns labeled \"Fund,\" \"Company,\" and \"GTM Assessment.\" All entries in the Fund column are \"Fund III\" and the companies listed are Slang, Cable, Medscout, and Prequel. The GTM Assessment column contains hyperlinked text reading \"Assessment here\" for each row.\n\nThe table uses a turquoise header row and alternating white rows for the data. At the bottom of the page is a footer stating \"Confidential | Do not distribute\"\n\nThe overall design is minimal and business-focused, using a consistent color scheme of white, black, and turquoise throughout the page.", "Page Number: 6": "This page appears to be from a presentation deck with a professional business layout. The header shows \"STAGE 2 CAPITAL\" in the top right corner. The main title \"Applying our GTM Thesis\" is prominently displayed with a subtitle \"As part of diligence\" underneath.\n\nThe page contains a section about \"Leading Indicator of Retention (LIR)\" with explanatory text about product-market fit (PMF) and customer retention metrics.\n\nAt the bottom of the page, there are two key visual elements:\n1. A light blue text box containing \"Case Study with Steelhead: here\" with \"here\" appearing to be a hyperlink\n2. The Steelhead Technologies logo, which appears in red and black colors. The logo features a stylized fish-eye or abstract symbol above the company name, with \"technologies\" written below in smaller text.\n\nThe page has a white background with black text, and includes a footer noting \"Confidential | Do not distribute\"", "Page Number: 7": "This page appears to be from a presentation titled \"Applying our GTM Thesis\" with \"Ongoing Support\" as a subtitle. The Stage 2 Capital logo appears in the top right corner. The main content discusses the Bottom's Up (BU) Model in a text block that explains their GTM Assessment approach.\n\nAt the bottom of the page, there are two visual elements:\n1. A light blue rectangular box containing text \"Case Study with MedScout:\" followed by a hyperlinked word \"here\"\n2. The MedScout company logo, which appears on the right side and consists of stylized blue geometric shapes forming what looks like an \"M\" alongside the text \"MedScout\"\n\nThe page has a clean, professional layout with a white background and includes a footer noting \"Confidential | Do not distribute\""}}