{"Stage 2 Capital Deck_2025.01.pdf": {"Page Number: 1": "Scaling with Science. Backed by GTM Expertise.  \nWe equip B2B founders with proven playbooks, expert GTM and finance guidance, and an LP network of 800+ executives who’ve done it before.  \n\nCONFIDENTIAL | Do Not Distribute  \n\nSTAGE 2 CAPITAL", "Page Number: 2": "STAGE 2 CAPITAL\n\nDisclaimer\n\nThe information in this presentation has been prepared by Stage 2 Capital Advisors, LLC (the \"Firm\") solely to determine preliminary investor interest in the applicable investment vehicle managed and/or advised by the Firm (the \"Fund\"). This presentation is not an offer or solicitation, and may not be used or relied upon in connection with any offer or solicitation, with respect to the Fund. An offer or solicitation with respect to the Fund, if made, will be made only through the Fund's Amended and Restated Limited Partnership Agreement and Subscription Agreement (collectively, the \"Governing Documents\"). The Governing Documents will be available to qualified investors upon request and will contain, among other things, a description of the risks and conflicts of interest associated with an investment in the Fund. The Fund's investments will be characterized by a high degree of risk, volatility and illiquidity. Prospective investors may lose all or a substantial amount of their investment in the Fund. An investment in the Fund may not be suitable for certain investors.\n\nCertain information contained herein has been obtained from third parties. While such sources are believed to be reliable, none of the Fund, its general partner, the Firm or their respective affiliates (collectively, the \"Firm Parties\") assume any responsibility for the accuracy or completeness of such information.\n\nThe information and opinions set forth in this presentation are for background purposes only and do not purport to be complete, and no obligation to update or otherwise revise such information is being assumed. The information set forth in this overview is current as of February 2024. A prospective investor must rely solely on the terms of, and the disclosure of information in, the Governing Documents, which is the only basis on which subscriptions may be made. The Fund reserves the right to modify any of the terms of the offering and the limited partnership interests described herein. The contents of this presentation are not to be considered legal, business, tax or other advice, and each prospective investor should consult its own attorney and business, tax and other advisors as to legal, business, tax and other matters related to an investment in the Fund. No person has been authorized to make any statement regarding the Fund other than as contained in the Governing Documents, and no such statements, if made, may be relied upon.\n\nIn considering the information contained herein, prospective investors should bear in mind that past performance is not necessarily indicative of future results, and there can be no assurance that the Fund will achieve comparable results or its investment objectives. Nothing contained herein should be considered a prediction or projection of future performance. There is no assurance that the Fund will make any profit or will be able to avoid incurring significant losses.\n\nCertain statements in this presentation constitute forward-looking statements, which may be identified by the use of forward-looking terminology such as \"may,\" \"will,\" \"seek,\" \"should,\" \"expect,\" \"anticipate,\" \"project,\" \"estimate,\" \"intend,\" \"continue,\" \"target,\" \"plan\" or \"believe\" or the negatives thereof or other variations thereon or comparable terminology. Such forward-looking statements, including the intended actions and performance objectives of the Firm Parties referenced herein, involve known and unknown risks, uncertainties, and other important factors that could cause the actual results, performance, or achievements of the Firm Parties to differ materially from any future results, performance, or achievements expressed or implied by such forward-looking statements.\n\nThis document has not been filed with or reviewed by the U.S. Securities and Exchange Commission, any U.S. state securities commission or any other regulatory authority, and no such authorities have passed upon or endorsed the merits of an investment in the Fund or the accuracy of the information in this document. Any representation to the contrary is a criminal offense.\n\nEach recipient acknowledges and agrees that the contents of this presentation constitute the proprietary and confidential information of the Firm Parties that (1) the Firm Parties derive independent economic value from not being generally known and (2) are the subject of reasonable efforts to maintain their secrecy. The recipient further acknowledges that the contents of this presentation are a trade secret, the disclosure of which is likely to cause substantial and irreparable competitive harm to the Firm Parties. The distribution or reproduction of this presentation in whole or in part, the divulgence of any of its contents, or the use of the contents for any purpose other than to determine interest for an investment in the Fund is strictly prohibited. This presentation will be returned to the Firm upon request.", "Page Number: 3": "Our Thesis  \nWe invest in B2B software companies at the Seed and Series A stage that grow efficiently, not just quickly. We leverage our deep bench of GTM LPs to help our founders achieve sustainable revenue growth.  \n\nThe page also includes several images depicting professional settings:\n- One image shows a group of people seated and engaged in what appears to be a presentation or meeting.\n- Another photo features two individuals conversing closely.\n- There is a picture of a man and a woman standing together, seemingly having a discussion.\n- One image includes a man speaking into a microphone in front of a large window.\n- Another image shows a group of three men standing and smiling, wearing name badges.\n- Another photo captures a conference or seminar setting with attendees facing a stage or presentation screen.\n- A woman is speaking into a microphone in one of the images, likely giving a presentation.", "Page Number: 4": "STAGE 2 CAPITAL\n\nFounder Story\nJay and Mark identified a significant GTM gap in the startup ecosystem, and set out to do things differently:\n\n- Shortly after taking HubSpot public, Mark’s angel investing revealed a glaring gap: founders weren’t getting the GTM guidance they needed.\n\n- At Bessemer, Jay saw how founders struggled with GTM strategy – from timing to scaling – sparking his mission to bridge this knowledge gap.\n\n- With this shared insight, Mark and Jay launched Stage 2 Capital: Silicon Valley’s first VC firm powered by GTM operators from the top tech companies.\n\nJay Po\nManaging Partner\nStage 2 Capital\nFormerly Bessemer Venture Partners\n\nMark Roberge\nManaging Partner\nStage 2 Capital\nFormerly Hubspot’s Founding CRO\n\nCONFIDENTIAL | Do Not Distribute", "Page Number: 5": "STAGE 2 CAPITAL\n\nOur Edge:\nA Unique Limited Partner Base\n\n800+ Senior Executive GTM LPs from top software companies globally.\n\n[Logos of various companies arranged in a grid]\n\nzoominfo | 6sense | snowflake | salesforce | HubSpot | GONG | Apollo.io | Clari\n\nGitHub | Envoy | Notion | Brex | asana | zoom | Guild | Dropbox\n\ncarta | okta | DRATA | klaviyo | smartsheet | databricks | webflow | WRITER\n\nCLOUDFLARE | grammarly | SailPoint | Calendly | Salesloft. | ORACLE | miro | servicenow\n\ntwilio | ATLASSIAN | paloalto NETWORKS | toast | DATADOG | shopify | freshworks | Seismic\n\ntalkdesk | gusto | checkr | PLAID | Airtable | AUTOMATION ANYWHERE | Cribl | contentful\n\nConfidential | Do Not Distribute\n\nAlthough certain investors in prior Stage 2 investment vehicles are affiliated with the companies referenced herein, Stage 2 is not directly affiliated with or endorsed by, and has not received an investment directly from, any such company. There can be no assurance that the investors in Fund IV will be affiliated with the same or similar companies as those referenced herein.", "Page Number: 6": "STAGE 2 CAPITAL\n\nWorld Class Limited Partners\n\nYamini Rangan  \nCEO  \nHubSpot\n\nNick Mehta  \nCEO  \nGainsight\n\nJim Steele  \nPresident  \nSalesforce\n\nClint Sharp  \nCEO  \nCribl\n\nTracey Newell  \nBoard Director  \nHighspot\n\nBrian Halligan  \nExec Chairman  \nHubSpot\n\nDJ Paoni  \nCEO  \nCertina\n\nCarol Meyers  \nBoard Director  \nMarkforged\n\nSue Barsamian  \nBoard Director  \nBox\n\nNeil Barua  \nCEO  \nPTC\n\nDoug Winter  \nCEO  \nSeismic\n\nJed Nachman  \nCOO  \nYelp\n\nJohanna Flower  \nBoard Director  \nCrowdStrike\n\nJohn McMahon  \nBoard Director  \nSnowflake\n\nMarc Huffman  \nCEO  \nOnBoard\n\nMatt Renner  \nPresident  \nGoogle Cloud", "Page Number: 7": "STAGE 2 CAPITAL\n\nGTM Limited Partners\n\nRevenue\nRyan Longfield  \nAmericas - Revenue  \nShopify logo\n\nErica Rullifson-Shultz  \nPresident  \nConfluent logo\n\nAshley Kramer  \nCMO & CSO  \nGitLab logo\n\nScott Holden  \nCMO  \nBrex logo\n\nSydney Sloan  \nCMO  \nG2 logo\n\nSarah Patterson  \nCMO  \nSamsara logo\n\nMarketing Customer Success\n\nSangeeta Chakraborty  \nCRO  \nMiro logo\n\nChris Degnan  \nCRO  \nSnowflake logo\n\nSean Walters  \nCRO  \nDatadog logo\n\nDionne Hedgpeth  \nCCO  \nSumo Logic logo\n\nMike Hutchinson  \nCCO  \nTeradata logo\n\nSanjay Kini  \nCCO & CSO  \n6sense logo\n\nCONFIDENTIAL | Do Not Distribute", "Page Number: 8": "STAGE 2 CAPITAL\n\nFund Progression\nIntroducing Fund IV\n\n$15M  \nFUND I  |  2018  \n11 Investments  \n$500K - 1M first checks  \n2.5% ownership\n\n$80M  \nFUND II  |  2020  \n19 Investments  \n$2 - 3M first checks  \n10% ownership\n\n$150M  \nFUND III  |  2022  \n18 - 20 Investments  \n$3 - 5M first checks  \n15% ownership\n\nTARGET  \n$150M  \nFUND IV  |  2025  \n18 - 22 Investments  \n$3 - 5M first checks  \n15% ownership", "Page Number: 9": "STAGE 2 CAPITAL\n\nInstitutional Backing\n\nMITIMCo\n\nRAINWATER\nCharitable Foundation\n\nGRAFTON STREET PARTNERS\n\nAthôs PRIVATE WEALTH\n\nHOLDINGS BROWN\n\nSherman Fairchild Foundation\n\nSupport from Top Institutions\n\nCONFIDENTIAL | Do Not Distribute", "Page Number: 10": "STAGE 2 CAPITAL\n\nReturn Profiles  \nStage 2 aims for investments with predictable upside on exit vs. moonshot companies with high burn profiles.\n\n[Visual: Two bar graphs side-by-side with the label \"vs.\" between them. The graph on the left displays several bars of varying heights with one significantly taller bar towards the right. The graph on the right has bars that start smaller and increase steadily in height with one tallest bar at the end.]\n\n[Image: A man standing and pointing at a whiteboard filled with tables of data labeled \"WIN %\" and \"RECORD\" with expected and actual values. In front of him, there are two people seated analyzing the data.]\n\nThink Moneyball vs. Powerball\n\nCONFIDENTIAL | Do Not Distribute", "Page Number: 11": "STAGE 2 CAPITAL\n\nFund Snapshot\n\nFund I  \n$32M Avg. Investment Post Money Valuation  \n2% Avg. Ownership  \n\n$15M  \nFund Size  \n\n11  \nInvestments  \n\nNotable Investments:  \nOrder  \nOcrolus  \nSendoso  \n\nExits:  \nListReports®  \nklara  \nonscale  \n\nFund II  \n$28M Avg. Investment Post Money Valuation  \n11.3% Avg. Ownership  \n\n$80M  \nFund Size  \n\n19  \nInvestments  \n\nNotable Investments:  \ngigpro  \nDeepScribe  \nmytime  \nQUOTAPATH  \n\nFund III  \n$33M Avg. Investment Post Money Valuation  \n13.7% Avg. Ownership  \n\n$150M  \nFund Size  \n\n19  \nInvestments  \n\nNotable Investments:  \nMedScout  \nSTEELHEAD technologies  \nBasis Theory  \nVERSORI  \nintelligems  \nmomentum  \nSlang  \n\nCONFIDENTIAL | Do Not Distribute", "Page Number: 12": "STAGE 2 CAPITAL\n\nOur Investment ICP\n\nAttributes\n- B2B Software\n- $500K-$1.5M ARR\n- Growing ARR 3x+ Y/Y\n- 100%+ NDR\n\nPrice Disciplined\nStage 2 stays disciplined on valuation. Average post money first check across 45+ companies:\nFund I: $32M; Fund II: $28M; Fund III: $33M\n\nLeverage LP Value\nStage 2 leverages LPs to access, win and diligence founders, markets, and products.\n\nFirst to Lead\nStage 2 takes the lead in discovering and catalyzing funding rounds.\n\nFounder-led to Team-led\nTarget companies are transitioning from founder-led selling to team-led selling.\n\nRigorous Evaluation Framework\nStage 2 evaluates the LIR: (Leading Indicators of Retention) to assess customer value creation and engagement.", "Page Number: 13": "STAGE 2 CAPITAL\n\nOur Approach:  \nPod Model\n\n1 Investor  \n+ 1 GTM Practitioner  \n\n3\n\nJay Po  \nManaging Partner  \nBessemer Venture Partners\n\nMark Roberge  \nManaging Partner  \nHubSpot\n\nLiz Christo  \nPartner  \nNetSuite\n\nSakib Dadi  \nPartner  \nBessemer Venture Partners\n\nCONFIDENTIAL | Do Not Distribute", "Page Number: 14": "STAGE 2 CAPITAL\n\nWe Invest in Capital-Conscious Founders Solving Real-World Challenges\n\nWe take board seats to work hand in hand with our founders to achieve efficient growth.\n\nCompany & Founder ICP\n\nCompany Attributes:\n- B2B Software\n- $500K–$1.5M ARR\n- Growing ARR 3x+ Y/Y\n- 100%+ NDR\n\nFounder Traits:\n- Efficient, capital-conscious.\n- Deep domain expertise with a track record of execution.\n- Built highly sticky software.\n\nMarkets:\n- Strong foothold in diverse end-markets like: construction, healthcare, logistics, financial institutions, utilities, energy, and manufacturing.\n\nProduct:\n- Focused on critical operating systems with high retention (90%+ GRR).\n\nGrowth Focus:\n- Aggressive but achievable with a priority on efficiency.\n\nGeography:\n- All regions\n\nThere is an icon resembling an asterisk or star included near the Company Attributes section.", "Page Number: 15": "STAGE 2 CAPITAL\n\nOur Model in Action: Slang  \nSlang scaled its GTM team and achieved 2x YoY growth while maintaining 100%+ NDR in the challenging SMB market.\n\nAbout Slang - Hospitality  \n- AI software that resolves customer inquiries and processes transactions with native integrations.\n\nWhy It Has Potential  \n- Addresses the growing demand for AI-driven customer interactions.  \n- Helps restaurants offset the rising costs of talent and unlock new revenue.  \n- Partnerships with OpenTable, Resy, SevenRooms and Tock strengthens its position as a go-to solution.\n\n[Visual: A bar chart labeled \"CARR\" showing growth over time. The horizontal axis is labeled with quarterly dates from Q1 '22 through Q4 '24. The vertical bars increase progressively, with a noted point for \"Stage 2 Investment\" early in the timeline. Below the chart is a label stating \"6.8x Growth Since Investment.\"]", "Page Number: 16": "STAGE 2 CAPITAL\n\nOur Model in Action: Basis Theory\n\nBasis Theory has doubled its revenue in six months, achieving 3x YoY growth and maintaining best-in-class 270% NDR.\n\nAbout Basis Theory - Fintech\n- Developer-first platform for protecting sensitive data through tokenization and encryption.\n- Empowers fintechs, merchants, and SaaS vendors to secure sensitive data.\n\nWhy It Has Potential\n- Regulatory changes and data breaches creates massive opportunity for a flexible, tokenized approach to data security.\n\n[CARR Graph]\nThe graph shows growth in CARR (presumably Committed Annual Recurring Revenue) from Q1'22 to Q4'24. There is a marked increase beginning at a point labeled \"Stage 2 Investment,\" after which the bars rise significantly, culminating in the highest bar at Q4'24.\n\nText box below graph:\n4.2x Growth Since Investment", "Page Number: 17": "STAGE 2 CAPITAL\n\nOur Model in Action: STEELHEAD technologies\n\nSteelhead has grown 3X+ YoY and successfully raised a Series B round in Q4 2024.\n\nAbout Steelhead - Manufacturing SaaS\n- Vertical software for job shop manufacturers to digitize plant operations.\n- Platform tracks part movement and work orders, automating capacity planning.\n- Increases visibility into job costs and margins.\n\nWhy It Has Potential\n- Manual processes and outdated systems leave manufacturers without visibility into profitability and job statuses.\n- Future expansion includes offerings like payroll, accounting, and payments.\n\n[Graph titled \"ARR\"]\n\nThe graph shows ARR growth by quarter from Q3 2022 to Q4 2024, indicating a significant increase in ARR after \"Stage 2 Investment,\" with ARR growing approximately 3 times since investment.\n\nBelow the graph, a box highlights \"3x Growth Since Investment.\"", "Page Number: 18": "STAGE 2 CAPITAL\n\nOur Model in Action: MedScout\n\nAchieved 2x+ YoY growth with strong capital efficiency while expanding from founder-led sales to a full sales team and raising their Series A.\n\nAbout MedScout – MedTech\n- GTM acceleration platform tailored for medical device and life sciences sellers.\n- Provides tools for pipeline generation and territory building, backed by medical insurance, claims, and referral data.\n\nWhy It Has Potential\n- Opportunities to expand beyond MedTech\n- Has $100M+ ARR potential in an established market and exit opportunities via M&A or public markets.\n\n[Graph titled \"ARR\"]\n- The graph shows the ARR growth from Q1'22 through Q4'24.\n- There is a marked point for \"Stage 2 Investment\" around Q1'23.\n- The graph demonstrates increasing ARR bars each quarter, culminating in a bar labeled with \"4.7x Growth Since Investment.\"", "Page Number: 19": "STAGE 2 CAPITAL\n\nOur Model in Action: momentum\nAchieved greater than 2.2x YoY growth with strong capital efficiency. Demonstrated a strong land and expand process with 150% NDR.\n\nAbout Momentum - GTM AI\n- Momentum unlocks the power of Enterprise listening to drive revenue and retention with powerful insights straight from your customers.\n- Provides an AI Data Pipeline that extracts, analyzes and acts on customer data.\n\nWhy It Has Potential\n- Poised to streamline GTM intelligence, reducing the need for companies purchase additional point solutions or platforms.\n- Solving real GTM problems like churn and pipeline accuracy without disrupting the sales process.\n\n[Visual Description]\nThere is a bar chart labeled \"ARR\" with the subtitle \"Stage 2 Investment.\" The x-axis has five time points labeled Q4 '23, Q1 '24, Q2 '24, Q3 '24, and Q4 '24 showing progressive increases in ARR throughout the quarters. An arrow points to the bar for Q3 '24 labeled \"Stage 2 Investment,\" indicating that the investment started or occurred around this time. Below the chart, there is a callout box stating \"1.9x Growth Since Investment.\"", "Page Number: 20": "STAGE 2 CAPITAL\n\nOur Model in Action: DeepScribe  \nAchieved over 67% growth by automating medical note-taking, gaining steady adoption among enterprise health systems.\n\nAbout DeepScribe - HealthTech  \n- AI-powered platform that automates medical note-taking for physicians.\n\nWhy It Has Potential  \n- Positioned to lead in healthcare transcription with one of the largest datasets.  \n- Has closed some of the largest health systems as customers with $12M+ in live ARR of medical notes.  \n- Strategic opportunities include premium EHR integrations or acquisition by leading health platforms.\n\n[Visual: A bar chart titled \"ARR\" showing quarterly growth over time from Q4 2020 to Q4 2024. The chart highlights the point of \"Stage 2 Investment\" around Q4 2021. The bars show steady increase each quarter with a total growth of 10.7x since investment.]  \n\n10.7x Growth since Investment", "Page Number: 21": "STAGE 2 CAPITAL\n\nOur Model in Action: Rally  \nAchieved just under 3x YoY growth with strong NRR and efficiency, hired a sales team and expanded into Enterprise.\n\nAbout Rally  \n- Research Operations Platform that makes it easy, fast and compliant for companies to do research on their own users.  \n- Rally’s comprehensive platform includes participant, study and panel management, external recruitment, scheduling, incentives and reporting.\n\nWhy It Has Potential  \n- Product development to enable expansion into Enterprise has grown the market size and ACV substantially.  \n- New AI product automates research operations workflows, enabling companies to reduce headcount.\n\nVisual:\nThere is a bar graph labeled \"ARR,\" showing growth over five time periods: Q4 '23, Q1 '24, Q2 '24, Q3 '24, and Q4 '24. The bars increase in height from Q4 '23 through Q4 '24, indicating growth. A label \"Stage 2 Investment\" points to the transition between Q4 '23 and Q1 '24. Below the graph, there is a highlighted text box stating \"4.7x Growth Since Investment.\"", "Page Number: 22": "STAGE 2 CAPITAL\n\nAndi Vanetta  \nOperating Partner  \n[Vanetta Logo]\n\nJohn Boucher  \nOperating Partner  \n[Oracle Logo]  \n[Seismic Logo]  \n[Vlocity Logo]\n\nLP Relations  \nA differentiated factor powering our LP base  \n\n- 75+ LP Advisors  \n- 100+ LP Talent Referrals  \n- 85% of Portfolio leveraged LP’s during Due Diligence  \n\nCONFIDENTIAL | Do Not Distribute", "Page Number: 23": "STAGE 2 CAPITAL\n\nLP Community  \nWays to get involved\n\nPortfolio Events  \nAttend sessions hosted by Founder/CEOs showcasing product roadmap and top of mind GTM initiatives.\n\nDiligence Support  \nAssist the Investment Team during the due diligence process to assess potential investments.\n\nVirtual All-Access  \nJoin Functional Roundtables and/or All Access Events with peer LP's around top of mind GTM topics.\n\nLP Connections  \nOpt-in to participate in virtual 1-1 LP connections powered by Slack and Orbit.\n\nPortfolio Advising  \nEngage as a formal or informal advisor to functional (CRO, CMO, CS, RevOps) leaders within the portfolio.\n\nLP Meetings  \nIn-person events featuring fund updates, portfolio presentations, and LP networking.\n\nCONFIDENTIAL | Do Not Distribute", "Page Number: 24": "STAGE 2 CAPITAL\n\nLeveraging Our Edge  \nLP involvement in our process  \n\nFind  \nLP network helps create consistent deal flow with access to top entrepreneurs. Example deals originating from LP referrals:  \n[AptEdge logo] [DeepScribe logo] [QUOTAPATH logo]  \n[MedScout logo] [gigpro logo] [arrow symbol]\n\nPick & Win  \nLPs play a critical role in due diligence, providing insights into market demand, product differentiation and competitive landscapes.  \nLPs involved in recent diligence:  \n• Sanjay Kini, CCO, 6Sense  \n• Dione Hedgepeth, CCO, Sumo Logic  \n• Emmanuelle Skala, SVP CS, Toast  \n• Mike Arntz, CRO, Smartsheet  \n• Glenn Seninger, GVP, Oracle  \n• Andrew Ettinger, CRO, Astronomer  \n• Jeetu Mahtani, EVP CS, HubSpot  \n\nSupport  \nAdvising on everything from capacity and territory planning to channel strategy and hiring.  \n\n75+  \nActive Advisors  \n\n100+  \nTalent Referrals Facilitated  \n\n80%  \nLP engagement with a portfolio company  \n\n100%  \nPortfolio company engagement with an LP  \n\nThere is no assurance that the investors in Fund IV will be similar to those in prior Stage 2 investment vehicles or that the Stage 2 investors will source or otherwise provide Fund IV with access to or assistance with investment opportunities of any particular type or quality.", "Page Number: 25": "STAGE 2 CAPITAL\n\nLP Engagement\nFormal Advisory Examples\n\n| Limited Partner      | Operating Experience                         | Portfolio Company                 |\n|---------------------|---------------------------------------------|---------------------------------|\n| Evelyn Swaim         | VP, Global Growth Marketing                  | Seismic           AptEdge        |\n| Mike Boyden          | Chief Revenue Officer                        | Tiled             MedScout      |\n| Omri Dahan           | Fmr. CRO                                    | Marqeta           Cable          |\n| Adam Mavrikos        | Fmr. VP, Sales & Revenue                     | Toast             Sendoso        |\n| Martin Moran         | Fmr. SVP Global Alliances                    | Salesforce        Veremark       |\n| John Davagian        | Chief Executive Officer                      | L2L               Steelhead Technologies |\n| Keshila Shannon      | SVP, Global Marketing                        | Deputy            Pear           |\n\nConfidential | Do Not Distribute\n\nAt the bottom of the page is a paragraph of small text stating:\nConfidential | Do not distribute | The securities of the companies referenced herein do not represent, and are not necessarily representative of, all of the securities recommended, purchased or sold by Stage 2. There is no assurance that the investments referenced herein were or will be profitable, and not all of the securities recommended, sold or purchased by Stage 2 will necessarily be as successful as those referenced herein. Some may have resulted in losses. Please contact Stage 2 for additional information regarding the historical investments of the Stage 2 investment vehicles. There can be no guaranty that Fund IV will have investment opportunities comparable in quality to those referenced herein.", "Page Number: 26": "STAGE 2 CAPITAL\n\nLP Engagement  \nFormal Advisory Examples\n\n| Limited Partner    | Operating Experience                | Portfolio Company            |\n|--------------------|-----------------------------------|-----------------------------|\n| Katie Bullard      | Fmr. President                    | ZoomInfo                    | Order (logo)                |\n| Jeb Dasteel        | Fmr. CCO                         | Oracle                      | Steelhead Technologies (logo) |\n| Chris Michelmore   | Head of Mid Market Sales          | Zoom                        | Sendoso                     |\n| Marc Huffman       | Chief Executive Officer           | OnBoard                     | Gappify                    |\n| Hayden Stafford    | Chief Revenue Officer             | Seismic                     | Quotapath                  |\n| Jonathan Marek     | Chief Operating Officer           | Guild                       | Opus                        |\n| Kirsten Knipp      | Chief Executive Officer           | Ask Nicely                  | AptEdge                    |\n\nConfidential | Do Not Distribute\n\nConfidential | Do not distribute (The securities of the companies referenced herein do not represent, and are not necessarily representative of, all of the securities recommended, purchased or sold by Stage 2. There is no assurance that the investments referenced herein were or will be profitable, and not all of the securities recommended, sold or purchased by Stage 2 will necessarily be as successful as those referenced herein. Some may have resulted in losses. Please contact Stage 2 for additional information regarding the historical investments of the Stage 2 investment vehicles. There can be no guaranty that Fund IV will have investment opportunities comparable in quality to those referenced herein.)\n\n26", "Page Number: 27": "STAGE 2 CAPITAL\n\nOur Team\n\nJay Po  \nManaging Partner  \nBessemer Venture Partners  \n\nKevin Swain  \nSr. Associate  \nVOLITION CAPITAL  \n\nLiz Christo  \nPartner  \nNETSUITE  \n\nMandy Cole  \nPartner  \nzenefits  \n\nSakib Dadi  \nPartner  \nBessemer Venture Partners  \n\nMark Roberge  \nManaging Partner  \nHubSpot  \n\nAndi Vanetta  \nOperating Partner  \nVANETTA  \n\nErin Olsen  \nHead of Marketing  \nVIRTUALITICS  \n\nJohn Boucher  \nOperating Partner  \nORACLE  \n\nRenee Ascrizzi  \nChief of Staff  \nRAPID7  \n\nSean Po  \nPartner, Catalyst  \nBank of America Merrill Lynch  \n\nCONFIDENTIAL | Do Not Distribute", "Page Number: 28": "STAGE 2 CAPITAL\n\nFund IV Overview\n\nTarget Fund Size & Timing  \n$150M / Sept 2024 first close\n\nTarget Fund Construction  \n350+ GTM LPs (150 New), 10+ Family Offices, 5+ Institutions\n\nFund Admin/ Law Firm/ Audit Firm  \nCarta (Fund Admin), Cooley LLP (Legal), RicheyMay (Tax), Frank Rimerman (Audit)\n\nPortfolio Construction  \n18-22 investments, 70% first checks, 30% follow on checks\n\nProposed Capital Call Schedule  \n25% 2025, 25% 2026, 25% 2027, 15% 2028, 10% 2029\n\nProposed Fund Terms  \n5 year investment period, 10 yr fund life plus extensions, 2/20 fee structure, European waterfall\n\nCONFIDENTIAL | Do Not Distribute", "Page Number: 29": "CONFIDENTIAL | Do Not Distribute\n\nAPPENDIX\n\nSTAGE 2 CAPITAL", "Page Number: 30": "STAGE 2 CAPITAL\n\nStage 2 Catalyst Fund  \nEarly Stage Investment with Practical GTM Support  \n\nExamples Portfolio Companies:\n\n- 15 company cohort – attending 11-week tactical GTM curriculum  \n- $150k investment on a SAFE  \n- Support from ~300 Catalyst LPs  \n\nLogos or icons representing the following companies (from left to right, top to bottom):  \nBloomfilter, Day.ai, SAVVI AI, BOUNTI, AUQUAN  \nStartProto, nodaFi, MLtwist, BEVZ, Atomos  \nAskEdith, MedScout, Revenue Roll, Persana AI, EmployeeCycle  \n\nThere is also a confidentiality notice indicating:  \n\"CONFIDENTIAL | Do Not Distribute\"  \n\nA footnote states:  \n\"Although certain investors in prior Stage 2 investment vehicles are affiliated with the companies referenced herein, Stage 2 is not directly affiliated with or endorsed by, and has not received an investment directly from, any such company. There can be no assurance that the investors in Fund IV will be affiliated with the same or similar companies as those referenced herein.\"", "Page Number: 31": "STAGE 2 CAPITAL\n\nAt the Core: Science of Scaling\n\nCommentary here about how Science of Scaling is the underpinning of the Stage 2 Capital investment approach.\n\nProduct Market Fit | Go-To-Market Fit | Growth and Moat\n\nProduct-market fit ensures your product meets market needs, using data to drive scaling decisions and validate long-term value.\n\nGo-to-market fit ensures your sales and marketing engine is repeatable, scalable, and aligned to drive efficient growth and sustainable success.\n\nGrowth and Moat is about scaling efficiently – focusing on healthy, sustainable growth.\n\nPlaybooks and Toolkits\n\nLP Advisory Support and Coaching", "Page Number: 32": "STAGE 2 CAPITAL\n\nSupport:  \nGTM Expertise Post Investment\n\n[GTM Expertise Post Investment Process Flow visual with four connected arrows pointing right, labeled as follows:]\n- GTM Assessment (Phase 1)\n- Alignment (Phase 2)\n- Scale Preparation (Phase 3)\n- Scale Acceleration (Phase 4)\n\nUnderneath the arrows, the following descriptive text is listed in four columns aligned with each phase:\n\nPhase 1 (Evaluate Starting Point)  \nComprehensive assessment and recommendations of company’s GTM opportunities  \n\nPhase 2 (Define the Plan)  \nClear priority and OKR setting to execute necessary actions  \n\nPhase 3 (Implement the Plan)  \nBuild bottoms up GTM plan with KPI reporting and establish scaling speedometer  \n\nPhase 4 (Hit Goals Consistently)  \nExecute go forward plan around revenue growth, retention, and efficiency  \n\n[Additional note below the columns:]  \n800+ LPs to support our portfolio companies across multiple disciplines", "Page Number: 33": "STAGE 2 CAPITAL\n\nPortfolio Performance\nFund I 2018 - 2019 Deployment Vintage\n\nCONFIDENTIAL | Do Not Distribute\n\nARR at Time of Investment v Q3 2024 ARR* by Cash Runway\n\nGraph with the following details:\n- Y-axis labeled \"ARR\" with monetary values ranging from $0 to $40,000,000 in increments of $10,000,000.\n- X-axis labeled \"Runway\" with categories: <6 mos, 6-12 mos, 12-24 mos, CF+.\n- Two data sets represented: \"ARR at Time of Investment\" and \"Q3 2024 ARR\"\n- Data shows \"ARR at Time of Investment\" and \"Q3 2024 ARR\" values for each \"Runway\" category, with Q3 2024 ARR generally higher than ARR at Time of Investment except for the <6 mos category where both are relatively low.\n\nEnd of text.", "Page Number: 34": "STAGE 2 CAPITAL\n\nPortfolio Performance\n\nFund II 2020 – 2022 Deployment Vintage\n\nARR at Time of Investment v Q3 2024 ARR* by Cash Runway\n\nARR (y-axis) with values ranging from $0 to $12,500,000\n\nRunway (x-axis): <6 mos, 6-12 mos, 12-24 mos, 24+ mos, CF+\n\nLegend:\n- ARR at Time of Investment (represented in the chart)\n- Q3 2024 ARR (represented in the chart)\n\n*Excludes pre-seed deals\n\nCONFIDENTIAL | Do Not Distribute", "Page Number: 35": "STAGE 2 CAPITAL\n\nPortfolio Performance\n\nFund III 2020 – 2024 (ongoing)\nDeployment Vintage\n\nARR at Time of Investment v Q3 2024 ARR* by Cash Runway\n\nThe graph shows ARR (Annual Recurring Revenue) on the vertical axis, ranging from $0 to $8,000,000, and Runway on the horizontal axis divided into four segments: <6 mos, 6-12 mos, 12-24 mos, and 24+ mos.\n\nTwo data series are presented:\n- ARR at Time of Investment\n- Q3 2024 ARR\n\nThe data points in the graph illustrate how ARR has changed from the time of investment to Q3 2024, segmented by the length of the cash runway at the time of investment. \n\n*Excludes pre-seed & cross fund deals\n\nCONFIDENTIAL | Do Not Distribute", "Page Number: 36": "STAGE 2 CAPITAL\n\nThank you.\n\nCONFIDENTIAL | Do Not Distribute"}, "Stage 2 Capital Performance Overview.pdf": {"Page Number: 1": "STAGE 2 CAPITAL\n\nCONFIDENTIAL | Do Not Distribute\n\nData Room Follow Up\n\nQ1 2025\n\nStage 2 Capital Data Room Follow Up", "Page Number: 2": "CONFIDENTIAL | Do Not Distribute  \nDisclaimer  \nThe information in this presentation has been prepared by Stage 2 Capital Advisors, LLC (the “Firm”) solely to determine preliminary investor interest in the applicable investment vehicle managed and/or advised by the Firm (the “Fund”). This presentation is not an offer or solicitation, and may not be used or relied upon in connection with any offer or solicitation, with respect to the Fund. An offer or solicitation with respect to the Fund, if made, will be made only through the Fund’s Amended and Restated Limited Partnership Agreement and Subscription Agreement (collectively, the “Governing Documents”). The Governing Documents will be available to qualified investors upon request and will contain, among other things, a description of the risks and conflicts of interest associated with an investment in the Fund. The Fund’s investments will be characterized by a high degree of risk, volatility and illiquidity. Prospective investors may lose all or a substantial amount of their investment in the Fund. An investment in the Fund may not be suitable for certain investors.  \nCertain information contained herein has been obtained from third parties. While such sources are believed to be reliable, none of the Fund, its general partner, the Firm or their respective affiliates (collectively, the “Firm Parties”) assume any responsibility for the accuracy or completeness of such information.  \nThe information and opinions set forth in this presentation are for background purposes only and do not purport to be complete, and no obligation to update or otherwise revise such information is being assumed. The information set forth in this overview is current as of February 2024. A prospective investor must rely solely on the terms of, and the disclosure of information in, the Governing Documents, which is the only basis on which subscriptions may be made. The Fund reserves the right to modify any of the terms of the offering and the limited partnership interests described herein. The contents of this presentation are not to be considered legal, business, tax or other advice, and each prospective investor should consult its own attorney and business, tax and other advisors as to legal, business, tax and other matters related to an investment in the Fund. No person has been authorized to make any statement regarding the Fund other than as contained in the Governing Documents, and no such statements, if made, may be relied upon.  \nIn considering the information contained herein, prospective investors should bear in mind that past performance is not necessarily indicative of future results, and there can be no assurance that the Fund will achieve comparable results or its investment objectives. Nothing contained herein should be considered a prediction or projection of future performance. There is no assurance that the Fund will make any profit or will be able to avoid incurring significant losses.  \nCertain statements in this presentation constitute forward-looking statements, which may be identified by the use of forward-looking terminology such as “may,” “will,” “seek,” “should,” “expect,” “anticipate,” “project,” “estimate,” “intend,” “continue,” “target,” “plan” or “believe” or the negatives thereof or other variations thereon or comparable terminology. Such forward-looking statements, including the intended actions and performance objectives of the Firm Parties referenced herein, involve known and unknown risks, uncertainties, and other important factors that could cause the actual results, performance, or achievements of the Firm Parties to differ materially from any future results, performance, or achievements expressed or implied by such forward-looking statements.  \nThis document has not been filed with or reviewed by the U.S. Securities and Exchange Commission, any U.S. state securities commission or any other regulatory authority, and no such authorities have passed upon or endorsed the merits of an investment in the Fund or the accuracy of the information in this document. Any representation to the contrary is a criminal offense.  \nEach recipient acknowledges and agrees that the contents of this presentation constitute the proprietary and confidential information of the Firm Parties that ➀ the Firm Parties derive independent economic value from not being generally known and ➁ are the subject of reasonable efforts to maintain their secrecy. The recipient further acknowledges that the contents of this presentation are a trade secret, the disclosure of which is likely to cause substantial and irreparable competitive harm to the Firm Parties. The distribution or reproduction of this presentation in whole or in part, the divulgence of any of its contents, or the use of the contents for any purpose other than to determine interest for an investment in the Fund is strictly prohibited. This presentation will be returned to the Firm upon request.", "Page Number: 3": "CONFIDENTIAL | Do Not Distribute  \nCheck Size & Ownership across Funds  \nDeal Type Evolution  \n  \nSTAGE 2 CAPITAL", "Page Number: 4": "CONFIDENTIAL | Do Not Distribute  \nStage 2 Capital  \n\nFund I  \n\nFirst investment and current ownership (inclusive of follow on round dilution)  \n\nFirst check: $500K-$750K  \nOwnership: 1%-3%  \n\nThe page contains two scatter plots:  \n\n1. Size of First Check  \n   - The vertical axis is labeled \"Size of First Check\" with values ranging from $0.00 to $1,000,000.00.  \n   - Data points are scattered between approximately $300,000 and $800,000.  \n\n2. Current Ownership  \n   - The vertical axis is labeled \"Current Ownership\" with values ranging from 0.00% to 5.00%.  \n   - Data points range roughly from 0.5% to about 4.2%.  \n\nAt the bottom right: \"Stage 2 Capital Data Room Follow Up.\"", "Page Number: 5": "CONFIDENTIAL | Do Not Distribute  \nFund II  \nFirst investment and current ownership (inclusive of follow on round dilution)*  \nFirst check: $1.5M - $3.5M  \nOwnership: 8% - 12%  \n\n*Excludes pre-seed deals  \n\nThere are two graphs on the page:  \n\n1. On the left, a scatter plot titled \"Size of First Check\" shows data points representing the size of initial investments. The y-axis is labeled \"Size of First Check\" with values ranging from $0.00 to $5,000,000.00. Most data points are clustered in the range of approximately $1,000,000 to $4,000,000, with a highlighted band between about $1,500,000 and $3,500,000, corresponding to the noted typical size of first checks.  \n\n2. On the right, a scatter plot titled \"Current Ownership\" shows the current ownership percentages inclusive of follow-on round dilution. The y-axis is labeled \"Current Ownership\" with percentages ranging from 0.00% to 25.00%. Most data points fall within the 8% to 12% range, highlighted as typical ownership. A few points go above and below this range.", "Page Number: 6": "STAGE 2 CAPITAL\n\nFund III\n\nFirst investment and current ownership (inclusive of follow on round dilution)*\n\nFirst check: $3M-$6M  \nOwnership: 10%-17%\n\n[Two scatter plot graphs are shown side by side below this text:\n\n1. The graph on the left is titled \"Size of first check.\" The vertical axis is labeled \"Size of first check\" with values ranging from $0 to $8,000,000. The scatter plot points mainly range between approximately $2,000,000 and $7,000,000.\n\n2. The graph on the right is titled \"Current Ownership.\" The vertical axis is labeled \"Current Ownership\" with percentages ranging from 0.00% to 20.00%. The scatter plot points mostly range between 10.00% and 17.00%, with one point around 5.00%.]\n\n*Excludes cross-fund deals.\n\nStage 2 Capital Data Room Follow Up", "Page Number: 7": "CONFIDENTIAL | Do Not Distribute  \nFund Performance  \nEvaluating performance from ARR Growth  \n\nSTAGE 2 CAPITAL  \n\nThere is an image of a mountain peak in the background.", "Page Number: 8": "STAGE 2 CAPITAL\n\nPortfolio Performance  \nFund I 2018 - 2019 Deployment Vintage  \n\nARR at Time of Investment v Q4 2024 ARR* by Cash Runway  \n\nThe page contains a bar chart with the following details:  \n\n- The vertical axis represents ARR (Annual Recurring Revenue), with increments labeled as $0, $10,000,000, $20,000,000, and $30,000,000.  \n- The horizontal axis represents Runway categories: \"<6 mos\", \"12-24 mos\", and \"CF+\".  \n- For each runway category, two bars are shown: one representing \"ARR at Time of Investment\" and one representing \"Q4 2024 ARR\".  \n\nThe chart shows that \"Q4 2024 ARR\" values are significantly higher than \"ARR at Time of Investment\" across all categories of cash runway. Specifically:  \n- For companies with less than 6 months runway, ARR at Time of Investment is near zero, and Q4 2024 ARR is higher but still the lowest compared to other runway categories.  \n- For companies with 12-24 months runway, ARR at Time of Investment is moderate, and Q4 2024 ARR is much higher, reaching nearly $30,000,000.  \n- For companies categorized as CF+ (cash flow positive), both the ARR at Time of Investment and Q4 2024 ARR are presented, with Q4 2024 ARR significantly higher than initial ARR.  \n\nLabels noted on the chart include:  \n- ARR at Time of Investment (orange bar)  \n- Q4 2024 ARR (teal bar)  \n\nNo additional textual content or numerical values are included on the graph.", "Page Number: 9": "STAGE 2 CAPITAL\n\nPortfolio Performance  \nFund II 2020 – 2022 Deployment Vintage\n\nARR at Time of Investment v Q4 2024 ARR* by Cash Runway\n\nThe graph displays ARR values on the vertical axis (ranging from $0 to $15,000,000) versus Cash Runway categories on the horizontal axis. The Cash Runway categories are divided into:  \n- <6 months  \n- 6-12 months  \n- 12-24 months  \n- 24+ months  \n- CF+\n\nTwo data sets are represented for each category:  \n1. ARR at Time of Investment  \n2. Q4 2024 ARR\n\nThe graph indicates that Q4 2024 ARR values are generally higher than ARR values at the time of investment across the runway categories, with the largest Q4 2024 ARR spikes visible in the 12-24 months and 24+ months categories.\n\n*Excludes pre-seed deals\n\nCONFIDENTIAL | Do Not Distribute", "Page Number: 10": "STAGE 2 CAPITAL\n\nPortfolio Performance\n\nFund III 2022 – 2024 (ongoing) Deployment Vintage\n\nARR at Time of Investment v Q4 2024 ARR* by Cash Runway\n\n$0  \n$2,000,000  \n$4,000,000  \n$6,000,000  \n$8,000,000  \n\nRunway category labels:  \n<6 mos  \n6-12 mos  \n12-24 mos  \n24+ mos  \n\nBar chart showing two sets of ARR values for each investment, grouped by runway categories:  \n- Orange bars represent ARR at Time of Investment  \n- Teal bars represent Q4 2024 ARR  \n\n*Excludes pre-seed & cross fund deals\n\nCONFIDENTIAL | Do Not Distribute", "Page Number: 11": "CONFIDENTIAL | Do Not Distribute\n\nStage 2’s Impact\nSelect Examples\n\nSTAGE 2 CAPITAL", "Page Number: 12": "CONFIDENTIAL | Do Not Distribute\n\nImplementing LIR  \nBefore  \nCS/AM Team qualitatively assessed churn risk through manual calls to customers.\n\nChange  \nImplement and review LIR tracker on a weekly basis to quantitatively measure customer health.\n\nResults/Impact  \n50-90%  \nreduction of time spent from the CS team to identify at-risk customers while maintaining <5% annual churn.\n\nImproving Close Rate  \nBefore  \nSales team ran unqualified POCs and had to re-sell the conversion from pilot to paid customer.\n\nChange  \nStage 2 introduced “success criteria” to the POC process to auto-convert based on the defined trigger/milestone.\n\nResults/Impact  \n2x  \nin conversion rate from pilot to paid after implementing success criteria based on clear proof of value.\n\n[Logos and Header Information]\n\nStage 2 Capital Data Room Follow Up", "Page Number: 13": "CONFIDENTIAL | Do Not Distribute\n\nSTAGE 2 CAPITAL\n\nMedScout\n\nAccelerating Pipeline  \nBefore: Reps were not hitting quota due to a lack of demand generation resulting in a high CAC payback.  \nChange: Hired Head of Marketing and 2 AEs, rolled out Stage 2 GTM playbook and implemented LIUE reporting.  \nResults/Impact: 385% from Dec to Feb and doubled qualified opportunities from Feb to July 2024. Two reps both hit their ramp quotas.\n\nDecreasing Churn with CS  \nBefore: Sales team ran unqualified POCs and had to re-sell the conversion from pilot to paid customer.  \nChange: Stage 2 introduced “success criteria” to the POC process to auto-convert based on the defined trigger/milestone.  \nResults/Impact: 2 accounts in H1 of 2024 remained. CS developed a 4 step engagement process to determine and measure LIR effectively, resulting in reduced churn.\n\nStage 2 Capital Data Room Follow Up", "Page Number: 14": "CONFIDENTIAL | Do Not Distribute\n\nSTAGE 2 CAPITAL\n\nOpus\n\nImproving Sales Efficiency  \nBefore: With only one salesperson, growth acceleration was bottlenecked by lack of demand generation.  \nChange: Realigned sales capacity with demand generation which led to right-sizing the AE team. Kicked off recruiting cycle for head of sales.  \nResults/Impact: 20-11  \nHired head of sales and brought CAC payback down from 20 months to 11 months. Hit opportunities goal in Q2 2024 and revenue goal in Q3 2024.\n\nGTM Ops & Data Visibility  \nBefore: No visibility into GTM data to drive decisions on marketing and sales.  \nChange: Built Bottoms Up model and introduced a Rev Ops consultant to configure tech stack and reporting to measure and manage to LIUE.  \nResults/Impact: Removed duplicate work and confusion created for prospects who had multiple reps reaching out. Clarified land and expand motion and realigned roles.\n\nThere is a small logo for \"STAGE 2 CAPITAL\" at the top left of the page and the word \"Opus\" prominently displayed below it. The rest of the content is divided into two main sections: \"Improving Sales Efficiency\" and \"GTM Ops & Data Visibility,\" each with columns labeled \"Before,\" \"Change,\" and \"Results/Impact.\"", "Page Number: 15": "CONFIDENTIAL | Do Not Distribute\n\nImplementing a Sales Methodology  \nBefore  \nNo sales process or qualification methodology led to inaccurate forecasting.  \n\nChange  \nStage 2 placed an LP as a Sales Advisor, Chris Reisig, who helped implement MEDDPICC.  \n\nResults/Impact  \n~50% of unqualified pipeline removed. Allowing the team to focus their time and improve forecast accuracy.  \n\nGTM Ops & Data Visibility  \nBefore  \nGTM team was junior and organized inefficiently by product line creating duplicative work and sub-par prospect experience.  \n\nChange  \nStage 2 referred VP of Sales and Senior AE through the LP Network and helped re-org the sales team around a target account strategy.  \n\nResults/Impact  \n>30%  \nSales team improved disco to close conversion rate from <10% in Q4 to >30% in H1 ‘24 and is consistently building pipeline for strong H2 coverage.\n\nImage description:  \nThe top left corner displays the AeroCloud logo, which consists of a stylized cloud with a curved line forming a 'C' shape intersecting with it. The text \"AeroCloud\" is next to the logo.  \n\nThe text layout is divided into two main sections:  \n- The first section discusses the implementation of a Sales Methodology, showing the before state (lack of sales process and inaccurate forecasting), the change enacted (placing an LP advisor who implemented MEDDPICC), and the results/impact (~50% pipeline improvement).  \n- The second section covers GTM Ops & Data Visibility, explaining the previous junior and inefficiently organized GTM team, the change made (reorganization around target account strategy through VP of Sales and Senior AE referrals), and the results/impact (improved conversion rate from below 10% to over 30%).  \n\nThere are arrows indicating the flow from \"Before\" to \"Change\" to \"Results/Impact\" for each of these sections.", "Page Number: 16": "CONFIDENTIAL | Do Not Distribute\n\nScaling Outbound Channel  \nBefore  \nA single marketing manager was running outbound on multiple domains with early signs of success, but no strategy on how to scale.\n\nChange  \nStage 2 recommended codifying the outbound playbook and hiring a BDR team aligned with a bottoms up model to scale this channel.\n\nResults/Impact  \nHired 6 BDRs and a manager to scale outbound. The team hit their ramp targets and is improving production MoM.\n\nRefining ICP  \nBefore  \nDuring the Q4 ‘23 board meeting we noticed a downward trend in NDR and decided to kick off work to address this trend.\n\nChange  \nHired CS Leader, shifted ICP no longer focusing on single unit restaurants, and defined 3 experiments for new upsell motions.\n\nResults/Impact  \nIn Q2 ‘24, expansion revenue grew 2.4X from Q1, closing $24k and 12 month NDR for ICP restaurant accounts was 120%.\n\n---\n\nVisual Information:  \n- The page includes two sections labeled \"Scaling Outbound Channel\" and \"Refining ICP.\"  \n- Each section follows a layout presenting \"Before,\" \"Change,\" and \"Results/Impact\" columns side-by-side.  \n- The \"Stage 2 Capital\" logo appears near the top left, and the \"Slang\" logo is visible.  \n- An arrow symbol is placed before the text in the \"Before\" columns of both sections.", "Page Number: 17": "CONFIDENTIAL | Do Not Distribute  \nThank you  \n\nSTAGE 2 CAPITAL"}, "Stage 2 Capital Portfolio Highlights.pdf": {"Page Number: 1": "STAGE 2 CAPITAL\n\nPortfolio Case Studies\n\nCONFIDENTIAL | Do Not Distribute", "Page Number: 2": "STAGE 2 CAPITAL\n\nOur Model in Action: Slang  \nSlang scaled its GTM team and achieved 2x YoY growth while maintaining 100%+ NDR in the challenging SMB market.\n\nAbout Slang - Hospitality  \n- AI software that resolves customer inquiries and processes transactions with native integrations.\n\nWhy It Has Potential  \n- Addresses the growing demand for AI-driven customer interactions.  \n- Helps restaurants offset the rising costs of talent and unlock new revenue.  \n- Partnerships with OpenTable, Resy, SevenRooms and Tock strengthens its position as a go-to solution.\n\nCARR\n\n[Graph titled \"Stage 2 Investment\" showing a steadily increasing bar chart of CARR (Cumulative Annual Recurring Revenue) from Q1 22 through Q4 24, reaching above $4,000,000 by Q4 24.]\n\n6.8x  \nGrowth Since Investment", "Page Number: 3": "STAGE 2 CAPITAL\n\nOur Model in Action: Basis Theory\n\nBasis Theory has doubled its revenue in six months, achieving 3x YoY growth and maintaining best-in-class 270% NDR.\n\nAbout Basis Theory - Fintech\n- Developer-first platform for protecting sensitive data through tokenization and encryption.\n- Empowers fintechs, merchants, and SaaS vendors to secure sensitive data.\n\nWhy It Has Potential\n- Regulatory changes and data breaches creates massive opportunity for a flexible, tokenized approach to data security.\n\n---\n\nCARR\n\n[Graph titled \"ARR\" showing a bar chart with values increasing from Q1 '22 to Q4 '24; a vertical line marks the point of \"Stage 2 Investment\". The values increase steadily with notable growth after the investment point, reaching above $4,000,000 by Q4 '24.]\n\n4.2x Growth Since Investment", "Page Number: 4": "STAGE 2 CAPITAL\n\nOur Model in Action: Steelhead technologies  \nSteelhead has grown 3X+ YoY and successfully raised a Series B round in Q4 2024.\n\nAbout Steelhead - Manufacturing SaaS  \n- Vertical software for job shop manufacturers to digitize plant operations.  \n- Platform tracks part movement and work orders, automating capacity planning.  \n- Increases visibility into job costs and margins.\n\nWhy It Has Potential  \n- Manual processes and outdated systems leave manufacturers without visibility into profitability and job statuses.  \n- Future expansion includes offerings like payroll, accounting, and payments.\n\nARR\n\nThe page includes a bar graph titled \"ARR\" showing revenue growth over time. The x-axis indicates quarters from Q3'22 through Q4'24 and the y-axis shows revenue amounts ranging from $0 to $4,000,000. A marker notes \"Stage 2 Investment\" around Q4'23. The bars show a steady increase in ARR, culminating in over $3,000,000 by Q4'24.  \n\nBelow the graph, there is a highlighted note stating \"3x Growth Since Investment.\"", "Page Number: 5": "STAGE 2 CAPITAL\n\nOur Model in Action: MedScout  \nAchieved 2x+ YoY growth with strong capital efficiency while expanding from founder-led sales to a full sales team and raising their Series A.\n\nAbout MedScout – MedTech  \n- GTM acceleration platform tailored for medical device and life sciences sellers.  \n- Provides tools for pipeline generation and territory building, backed by medical insurance, claims, and referral data.\n\nWhy It Has Potential  \n- Opportunities to expand beyond MedTech  \n- Has $100M+ ARR potential in an established market and exit opportunities via M&A or public markets.\n\n[Graph titled \"ARR\"]  \nThe graph shows annual recurring revenue (ARR) growth from Q1’22 to Q4’24 with a Stage 2 Investment marked approximately between Q4’22 and Q1’23, highlighting a 4.7x growth since investment. The revenue scale on the vertical axis goes from $0 to $4,000,000. Bars show steady growth with a marked increase post investment, reaching almost $4 million by Q4'24.", "Page Number: 6": "STAGE 2 CAPITAL\n\nOur Model in Action: momentum\n\nAchieved greater than 2.2x YoY growth with strong capital efficiency. Demonstrated a strong land and expand process with 150% NDR.\n\nAbout Momentum - GTM AI\n- Momentum unlocks the power of Enterprise listening to drive revenue and retention with powerful insights straight from your customers.\n- Provides an AI Data Pipeline that extracts, analyzes and acts on customer data.\n\nWhy It Has Potential\n- Poised to streamline GTM intelligence, reducing the need for companies to purchase additional point solutions or platforms.\n- Solving real GTM problems like churn and pipeline accuracy without disrupting the sales process.\n\n[Graph titled \"ARR\" with a subtitle \"Stage 2 Investment\"]\n\nThe graph shows increasing annual recurring revenue (ARR) over five quarters:\n- Q4 '23: Just under $1,000,000\n- Q1 '24: Slightly above $1,000,000\n- Q2 '24: Approximately $1,300,000\n- Q3 '24: Approximately $1,500,000\n- Q4 '24: Approximately $1,850,000\n\nBelow the graph is a highlighted text box stating:\n\n1.9x  \nGrowth Since Investment", "Page Number: 7": "STAGE 2 CAPITAL\n\nCONFIDENTIAL | Do Not Distribute\n\nOur Model in Action: DeepScribe  \nAchieved over 67% growth by automating medical note-taking, gaining steady adoption among enterprise health systems.\n\nAbout DeepScribe - HealthTech  \n- AI-powered platform that automates medical note-taking for physicians.\n\nWhy It Has Potential  \n- Positioned to lead in healthcare transcription with one of the largest datasets.  \n- Has closed some of the largest health systems as customers with $15M+ in live ARR of medical notes.  \n- Strategic opportunities include premium EHR integrations or acquisition by leading health platforms.\n\n[Graph Title: ARR]  \nThe graph shows ARR (Annual Recurring Revenue) growth over time from Q4'20 to Q4'24. On the vertical axis, ARR is measured in dollars ranging from $0 to $15,000,000. The line indicates a steady increase in ARR with marked growth after the Stage 2 Investment point around Q2'21. By Q4'24 the ARR reaches near $15,000,000.  \n\nAn annotation within the graph highlights \"Stage 2 Investment,\" aligned vertically to Q2'21.\n\nBelow the graph, a highlighted figure reads:  \n10.7x Growth since Investment", "Page Number: 8": "STAGE 2 CAPITAL\n\nOur Model in Action: Rally  \nAchieved just under 3x YoY growth with strong NRR and efficiency, hired a sales team and expanded into Enterprise.\n\nAbout Rally  \n- Research Operations Platform that makes it easy, fast and compliant for companies to do research on their own users.  \n- Rally’s comprehensive platform includes participant, study and panel management, external recruitment, scheduling, incentives and reporting.\n\nWhy It Has Potential  \n- Product development to enable expansion into Enterprise has grown the market size and ACV substantially.  \n- New AI product automates research operations workflows, enabling companies to reduce headcount.\n\n[Graph titled ARR]  \nThe graph shows a bar chart with revenue progression across quarters:  \n- Q4 '23 revenue is just above $500,000  \n- Q1 '24 revenue is about $800,000  \n- Q2 '24 revenue is about $1,000,000  \n- Q3 '24 revenue is about $1,200,000  \n- Q4 '24 revenue is about $1,900,000\n\nThere is an annotation for \"Stage 2 Investment\" between Q4 ‘23 and Q1 ‘24, indicating the time of investment.  \n\nBelow the graph, there is a box highlighting \"4.7x Growth Since Investment.\"", "Page Number: 9": "STAGE 2 CAPITAL\n\nOur Model in Action: QUOTAPATH\n\nHas grown 13.2x since time of investment. Have re-accelerated growth after weathering ’21 market headwinds and now positioned as go-to solution for commission tracking in SMB and MM.\n\nAbout QuotaPath - Commission Management\n- Simplifies compensation planning, forecasting, and payouts to ensure timely and accurate commission payments.\n\nWhy It Has Potential\n- Opportunities to expand 1) beyond commission tracking into GTM planning and 2) to additional verticals with variable compensation needs.\n- Strong strategic exit options including partners like Hubspot or rollup as part of a commission data or GTM platform.\n\nGraph titled \"ARR\":\nThe graph shows quarterly ARR growth from Q2’21 through Q2’24, with a marked increase following the Stage 2 Investment point around Q4’21. The ARR grows from near $0 to about $6,500,000 by Q2’24. \nThe graph highlights “13.2x Growth since Investment.”"}, "Value Add_ GTM Support Methodologies.pdf": {"Page Number: 1": "STAGE 2 CAPITAL\n\nValue Add &\nGTM Support Methodologies", "Page Number: 2": "Support: GTM Expertise Post Investment  \nLeveraging Pods / LPs / Frameworks / Playbooks  \n\nGTM Assessment → Alignment → Scale Preparation → Scale Acceleration  \n\nPhase 1  \nEvaluate Starting Point  \nComprehensive assessment and recommendations of company's GTM opportunities  \n\nPhase 2  \nDefine the Plan  \nClear priority and OKR setting to execute necessary actions  \n\nPhase 3  \nImplement the Plan  \nBuild bottoms up GTM plan with KPI reporting and establish scaling speedometer  \n\nPhase 4  \nHit Goals Consistently  \nExecute go forward plan around revenue growth, retention, and efficiency  \n\n500+ LPs to support our portfolio companies across multiple disciplines  \n\n[STAGE 2 CAPITAL logo]  \n\n[Confidential | Do not distribute]", "Page Number: 3": "Applying our GTM Thesis\n\nEarly Support: Pre and Post Investment\n\nInvestment Memo\nSummary of diligence with GTM lens\n\nGTM Assessment\nDeep dive on current state and recommendations\n\nLeading Indicators of Retention\nSignals for product market fit\n\nOngoing Support\n\nGTM Scorecard\nKPIs to focus on each quarter\n\nBottoms Up Model\nUnit economics of rep success\n\nAnnual Planning\nBU model with financial targets\n\nBig Bet\nStrategic initiative to drive growth\n\nFundraising Scorecard\nFundraising planning tool\n\n(Stage 2 Capital logo appears in the top right corner.)", "Page Number: 4": "Applying our GTM Thesis  \nPre-Investment  \n\nInvestment Memo  \nPre-investment, our Finance Partners deliver a thorough summary of our diligence findings and a recommendation on an investment in the form of a memo. All memos include an overview of the product, business performance, market opportunity, competitive analysis, assessment of CEO and a scenario analysis, with freedom to include other sections as appropriate. They are delivered to the Partnership for review ahead of a company presentation.  \n\nRecent Examples:  \n| Fund    | Company   | Investment Memo      |  \n|---------|-----------|---------------------|  \n| Fund III| Steelhead | Memo here           |  \n| Fund III| AptEdge   | Memo here           |  \n| Fund III| Medscout  | Memo here           |  \n| Fund III| Cable     | Memo here           |  \n\nThere is a logo or label that reads \"STAGE 2 CAPITAL.\"  \n\nThe page contains a table listing recent examples of investment memos by fund and company with links labeled \"Memo here.\"", "Page Number: 5": "Applying our GTM Thesis  \nPost-Investment  \n\nGTM Assessment  \nPost-investment, our GTM Partners lead a deep dive on all things go-to-market. We start with gathering funnel data, reviewing any/all resources for onboarding new hires, watching a few demos, call recordings, and meeting members of the GTM team. The output is a document summarizing our observations and recommendations that is shared with the company and used to set goals for the coming months. Selecting the two or three areas where improvement will unlock the most potential for revenue acceleration is critical to focusing company resources.  \n\nExamples:  \n\n| Fund     | Company  | GTM Assessment     |  \n|----------|----------|--------------------|  \n| Fund III | Slang    | Assessment here    |  \n| Fund III | Cable    | Assessment here    |  \n| Fund III | Medscout | Assessment here    |  \n| Fund III | Prequel  | Assessment here    |  \n\nAt the top right corner of the page is a logo or badge that reads \"STAGE 2 CAPITAL\".  \n\nIn the bottom right corner of the page is a note stating \"Confidential | Do not distribute\".", "Page Number: 6": "Applying our GTM Thesis  \nAs part of diligence  \n\nLeading Indicator of Retention (LIR)  \nWe look to back companies that have shown indicators of product-market fit (PMF). While customer retention is perhaps the best statistical representation of PMF, it’s a lagging indicator, meaning that it often takes quarters or years for companies to know the true retention of customers acquired today. As a result, we typically look to define and measure a Leading Indicator of Retention (LIR) to (1) gain comfort around PMF and (2) set us up for success in helping that potential portfolio company with go-to-market down the line.  \n\nCase Study with Steelhead: here  \n\nSTEELHEAD  \ntechnologies  \n\nSTAGE 2 CAPITAL  \n\nConfidential | Do not distribute", "Page Number: 7": "Applying our GTM Thesis  \nOngoing Support  \n\nBottom’s Up (BU) Model  \n\nOne key deliverable of our GTM Assessment is a capacity and metrics-driven bottom’s up revenue plan. Companies we invest in often have some version of a top-down financial model in place with imperfect drivers like expected conversion rate on marketing spend. In order to increase the predictability of the forecast, we hone in on productivity per rep, deal size, and headcount which draws on historical trends and is both objective and measurable. The bottom’s up model is meant to be a living framework, and updates/refreshes are typically required every 6 to 12 months to adjust for performance relative to plan.  \n\nCase Study with MedScout: here  \n\nThe page also includes the MedScout logo and the Stage 2 Capital logo."}}